{
  "script_id": "143",
  "name": "words_tools.vim",
  "summary": "Alternatives to expand(\"<cword>\")",
  "script_type": "utility",
  "description": "A tip would have been more accurate regarding what I am presenting here. But as some functions proposed are needed by another script of mine, here is a script file containing the definitions of three functions that can be used instead of expand(\"<cword>\").\n\nexpand(\"<cword>\") is a nice feature in VIM, but it is not very helpful when we have to deal with automatic completion -- you know : when you hit <tab> within VIM's command line or your favourite shell. Indeed, \"<cword>\" refers to the word under/after the cursor, while we need the word under/before the cursor.\n\nSo, here is three functions :\n* GetPreviousWord() that returns the word preceding the cursor ; the word is either truncated at the cursor's position or completed by as many spaces as needed to reach this position. I call a word, a sequence of keyword characters ('\\k', see :h isk).\n  It is handy, in C programming, to test what precedes the cursor when we hit '(', and then expand C control-structures (for, if, else, elif, switch, etc.) to anything desired.\n\n* GetCurrentWord() returns the word which is either stricly under the cursor or just before -- if the cursor is preceded by a space, an empty string is returned. Here, a word is a sequence of non white space characters : '\\S' -- in order to expand regular expressions. \n  Cf. http://vim.sourceforge.net/scripts/script.php?script_id=46 v2.2\n\n* GetNearestWord() returns the word ('\\S') either under, just before or just after the cursor.\n\nYou can take a look at a table showing the different returned values by this functions in equivalent contexts : http://hermitte.free.fr/vim/general.php3#expl_words_tools\n\nAs I said before, a tip would have been more appropriate. These functions are just examples of want could be done on this topic. They fulfill some specific needs I had. ",
  "rating_total": "12",
  "rating_votes": "3",
  "downloads": "912",
  "install_details": "Drop it in your macros folder and source it when needed.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=344",
      "filename": "words_tools.vim",
      "script_version": "1.0",
      "date": "2001-11-13",
      "vim_version": "5.7",
      "author": {
        "user_id": "102",
        "user_name": "hermitte",
        "first_name": "Luc",
        "last_name": "Hermitte",
        "email": "hermitte at free.fr",
        "homepage": "http://hermitte.free.fr/vim"
      },
      "release_notes": "Initial upload"
    }
  ]
}