{
  "script_id": "180",
  "display_name": "remcmd.vim",
  "summary": "Send commands to remote Vim sessions",
  "name": "remcmd.vim",
  "script_type": "utility",
  "description": "This script came out of my misc utility functions to send some useful commands to a remote Vim session. It basically adds four commands as follows (assuming that your <Leader> is set to \\):\n\n    \\ro - Opens the current file in a remote Vim session.\n    \\re - Executes a command in the remote Vim session.\n    \\ta - Opens the current tag in the remote Vim session.\n    \\ts - Selects the current tag in the remote Vim session.\n\nEach one of the above commands prompts the user to select the name of a remote Vim and executes the command. To make your life easier, it even remembers your previous selection, so repeated execution of remote commands in the same remote Vim session is easy.\n\nThough it adds only 4, it is because I don't know what commans other might like to add. But it is easy enough for you to add your favourite commands this way. It exposes the basic functions necessary to do it yourself from your own script or .vimrc:\n\n       RemCmdServerList(), RemCmdSelectServer(), RemCmdSendRemoteCommand()\n\nTake a look at the script on how to use these functions. For convenience, you can add regular and/or popup menu group for this with the name \"Remcmd\" by setting some global variables in your .vimrc. Take a look at the script header for details.\n",
  "rating_total": "20",
  "rating_votes": "5",
  "downloads": "1243",
  "install_details": "Just drop it in your plugin directory or source it from your .vimrc.\n\nYou need multvals.vim (2.0.4) for this to work, download from:\nhttp://vim.sourceforge.net/scripts/script.php?script_id=171",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=616",
      "filename": "remcmd.vim",
      "script_version": "1.0.7",
      "date": "2002-02-20",
      "vim_version": "6.0",
      "author": {
        "user_id": "292",
        "user_name": "haridsv",
        "first_name": "Hari Krishna",
        "last_name": "Dara",
        "email": "hari.vim at gmail.com",
        "homepage": ""
      },
      "release_notes": "Added register sharing capability with some limitations. You can specify a list of comma separated local registers to be synced to remote registers. You can even specify a different remote register than the local one. The following is very useful:\n\n  let g:remcmdRegisters='\"'\n  let g:remcmdRemoteRegisters='r'\n\nThis makes whatever you copy in whichever Vim window always available in the r (for remote) register of other vim windows. However there are some limitations, it doesn't automatically sync when the yank (or delete) command starts with y (or d), such as y'a. Use RCmdSyncRegisters or the SyncRegisters menu (if menu is enabled) to force a sync. You can enable the main menu or popup menu by setting the following variables:\n\n    let g:remcmdAddToMenu=1\n    let g:remcmdAddToPopupMenu=1\n\nPlease see the script for more features, sorry I don't have time to write a help page. Please send in your feedback."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=550",
      "filename": "remcmd.vim",
      "script_version": "1.0.3",
      "date": "2002-02-04",
      "vim_version": "6.0",
      "author": {
        "user_id": "292",
        "user_name": "haridsv",
        "first_name": "Hari Krishna",
        "last_name": "Dara",
        "email": "hari.vim at gmail.com",
        "homepage": ""
      },
      "release_notes": "Added RCmdPresetServer command that takes in a server name to be used for all the operations. Until you call the same command passing an empty string \"\", you will not prompted to select the server, which makes it easy to execute repeated remote commands in the same remote session.\n\nAlso added two new commands \\sf and \\sb to search forward and backward for the current word in the remote session."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=468",
      "filename": "remcmd.vim",
      "script_version": "1.0.1",
      "date": "2002-01-11",
      "vim_version": "6.0",
      "author": {
        "user_id": "292",
        "user_name": "haridsv",
        "first_name": "Hari Krishna",
        "last_name": "Dara",
        "email": "hari.vim at gmail.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
