{
  "script_id": "193",
  "display_name": "fortune.vim -- Avadhanula",
  "summary": "Adding fortunes to your e-mails and fancy mail quoting",
  "name": "fortune.vim--Avadhanula",
  "script_type": "utility",
  "description": "This script provides a way to have vim put a fortune at the end of your mail messages. Most unix mail clients automatically handle the capability of having a program output as the signature file, but most windows mail clients, (at least PC-pine) do not (yet) provide a way to do this. This script provides a vim way to do the equivalent, if your mail client is capable of using external editors to compose mails. \n\nIn addition, this script also provides a way to change the style in which you quote the reply to your mails. by default, PC-pine quotes messages with the header:\n   On Sat 12 Jun 2001, John Doe wrote:\ntoo boring? \nThis script will change this to:\n   In our last exciting episode on Sat 12 Jun 2001, John Doe said:\nYou can ofcourse customize this to your special whackiness by changing the function ReplaceQuote().\n",
  "rating_total": "2",
  "rating_votes": "3",
  "downloads": "908",
  "install_details": "1. download the file into your ~/.vim/plugin directory.\n2. create a signature file which looks like:\n    -----%<-----\n    -- \n    Srinath Avadhanula\n    _REPLACE_WITH_FORTUNE_\n    -----%<-----\n   (only the last line is necessary).\n3. in your mail client configuration, set this as your signature file. \n   (for pine, this is in the configuration screen).\n4. download and install the fortune program somewhere so that its in your\n   path and vim can source its output with a simple \". ! fortune\" command.\n   if you have cygwin installed, then running a google search for \"fortune\n   cygwin\" turns up many relevant hits. just download the relevant .tar.gz\n   file and untar it into cygwin's root directory.\n\nYou will need to use a mail client which is capable of using external\neditors to compose mails. (Outlook readily dissapears from my mind).\nSome mail clients on windows platforms having this feature:\n\n   PC-pine: http://www.washington.edu/pine/pc-pine/\n  Mahogany: http://mahogany.sourceforge.net/\n\n(I've been using PC-pine exclusively for many moons now).\n\nNOTE:\nIf the fancy mail quoting does not seem to be working for you check that\nyour mail client quotes replies either with the header:\n   On Sat 12 Jun 2001, John Doe wrote:\nor\n   On 12 Jun 2001, John Doe wrote:\nIf its some other format, you will need to tweak the function\nReplaceQuote() (please consider sending me a patch if you do this). \n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=519",
      "filename": "fortune.vim",
      "script_version": "1.0",
      "date": "2002-01-30",
      "vim_version": "6.0",
      "author": {
        "user_id": "247",
        "user_name": "srinath.avadhanula",
        "first_name": "Srinath",
        "last_name": "Avadhanula",
        "email": "srinath at fastmail.fm",
        "homepage": "http://robotics.eecs.berkeley.edu/~srinath/index.html"
      },
      "release_notes": "Initial upload"
    }
  ]
}
