{
  "script_id": "215",
  "name": "tagmenu.vim",
  "summary": "Tags menu for various programming language source files",
  "script_type": "utility",
  "description": "The taglist plugin supersedes the tags menu plugin. The taglist plugin\nintegrates the functionality of the tagsmenu plugin.\n\n The taglist plugin displays the list of tags defined in the current file in the\n\"Tags\" menu (in GUI Vim). The taglist plugin provides much more\nfunctionality than the tagsmenu plugin. You can download it from:\n\nhttp://vim.sourceforge.net/scripts/script.php?script_id=273\n\nYou can get more information about the taglist plugin from the\nfollowing page:\n\n    http://vim-taglist.sourceforge.net\n\nThe tags menu plugin is no longer maintained.\n\nOverview\n\nThe \"Tags Menu\" plugin provides the following features:\n\n1. Creates a \"Tags\" menu containing all the tags (variables, functions,\n   classes, methods, macros, etc) defined in the current file.\n2. Creates a popup menu with the contents of the \"Tags\" menu. This popup\n   menu can be accessed  by right clicking the mouse.\n3. Groups the tags by their type and displays them in separate submenus.\n4. The \"Tags\" menu can be sorted either by name or by line number.\n5. When a tag name is selected from the \"Tags\" menu, positions the cursor\n   at the definition of the tag.\n6. Automatically updates the \"Tags\" menu as you switch between\n   files/buffers.\n7. If the number of tags in a particular type exceeds a configurable limit,\n   splits the menu for that tag type into one or more submenus.\n8. Supports the following language files: Assembly, ASP, Awk, C, C++,\n   Cobol, Eiffel, Fortran, Java, Lisp, Make, Pascal, Perl, PHP, Python,\n   Rexx, Ruby, Scheme, Shell, Slang, TCL, Verilog, Vim and Yacc.\n9. Runs in all the platforms where the exuberant ctags utility and Vim are\n   supported (this includes MS-Windows and Unix based systems).\n10. Will run only in the GUI version of Vim.\n11. The ctags output for a file is cached to speed up updating the \"Tags\"\n    menu.\n\nThis script relies on the exuberant ctags utility to get the tags defined in\na file. You can download the exuberant ctags utility from\nhttp://ctags.sourceforge.net. The exuberant ctags utility must be installed\nin your system to use this plugin. You should use exuberant ctags version\n5.3 and above.  There is no need for you to create a tags file to use this\nplugin.\n\nConfiguration\n\nBy changing the following variables you can configure the behavior of this\nscript. Set the following variables in your .vimrc file using the 'let'\ncommand.\n\nThe script uses the Tmenu_ctags_cmd variable to locate the ctags utility.\nBy default, this is set to ctags. Set this variable to point to the\nlocation of the ctags utility in your system:\n\n          let Tmenu_ctags_cmd = 'd:\\tools\\ctags.exe'\n\nIf a file contains too many tags of a particular type (function, variable,\netc), greater than a configurable limit, then the tags menu for that tag\ntype will be split into sub-menus.  The default limit is 25.  This can be\nchanged by setting the Tmenu_max_submenu_items variable:\n\n          let Tmenu_max_submenu_items = 20\n\nIf the number of tags of a particular tag type is more than that specified\nby Tmenu_max_submenu_items setting, then the tags menu for that tag type\nwill be split into sub-menus. The name of the submenu is formed using the\nnames of the first and the last tag entries in that submenu. Only the first\nTmenu_max_tag_length characters from these names will be used to form the\nsubmenu name. Change the Tmenu_max_tag_length setting if you want to include\nmore or less characters:\n\n          let Tmenu_max_tag_length = 10\n\nBy default, the tag names will be added to the menu in the order in which\nthey are defined in the file. You can alphabetically sort the tag names\nin the menu by selecting the \"Sort menu by->Name\" menu item. You can also\nchange the default order by setting the variable Tmenu_sort_type to\n\"name\" or \"order\":\n\n          let Tmenu_sort_type = \"name\"\n\nThis script will not work in 'compatible' mode.  Make sure the 'compatible'\noption is not set. This script depends on the file type detected by Vim.\nMake sure the Vim file type detection (:filetype on) is turned on.",
  "rating_total": "378",
  "rating_votes": "131",
  "downloads": "8052",
  "install_details": "1. Copy the tagmenu.vim script to the .vim/plugin directory.  Refer to\n    'help add-plugin', 'help add-global-plugin' and 'help runtimepath' for \n    more details.\n2. Set the Tmenu_ctags_cmd variable to point to the exuberant ctags \n    utility path.\n3. If you have previously used the funcmenu.vim plugin script, remove it\n    from your ~/.vim/plugin directory.\n4. Restart GVim.\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1396",
      "filename": "tagmenu.vim",
      "script_version": "1.31",
      "date": "2002-11-11",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Fixed a problem with processing tags with \"|\" in the search pattern."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1250",
      "filename": "tagmenu.vim",
      "script_version": "1.3",
      "date": "2002-09-25",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Added support for popup menus (Thomas Kimpton), verilog language and updated comments."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=962",
      "filename": "tagmenu.vim",
      "script_version": "1.2",
      "date": "2002-06-28",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Handle multiple tags with same name. Center the selected tag line. Rename the menu names to be consistent with other menus."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=783",
      "filename": "funcmenu.vim",
      "script_version": "1.4",
      "date": "2002-04-11",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Fix for handling long filenames.\nPass the Vim filetype to ctags."
    }
  ]
}