{
  "script_id": "232",
  "display_name": "spell.vim",
  "summary": "Vim 'spell' utility plugin",
  "name": "spell.vim",
  "script_type": "utility",
  "description": "\nVim plugin for using the 'spell' Unix utility.  Provides commands to spell\ncheck the current buffer, or a range of lines in the current buffer, current\nword or a supplied string and to highlight misspelled words.  This plugin\nprovides the functionality similar to that provided by the emacs spell.el\nscript.\n\nThis plugin provides the following commands: \n\n   1. Spell\n      Spell check lines in the current buffer.  The default behavior is to\n      spell check the entire buffer. You can specify an ex command-line\n      range to spell check only lines in that range. If a word is\n      misspelled, you will be prompted to enter the correct spelling for the\n      word.  If you enter the correct spelling, then you will be prompted\n      for replacing every occurrence of that word in the current buffer.  If\n      you press just enter, then the word will be skipped.  If you press\n      <Esc>, the spell check will be stopped. \n\n   2. SpellWord \n      Check the spelling of the current word under the cursor. If the word\n      is misspelled, you will be prompted for the correct spelling.  If you\n      enter the correct spelling, you will be prompted for replacing every\n      occurrence of that word in the current buffer.  If you press just\n      enter, then the word will be skipped. \n\n   3. SpellString <string> \n      Check the spelling of the supplied string.  All the misspelled words\n      in the string will be displayed. \n\n   4. SpellHighlight\n      Highlight all the misspelled words in the current buffer. This command\n      also takes a range of lines.\n\n   5. SpellHighlightClear\n      Clear the highlighting for the misspelled words.\n\nThe 'spell' utility only checks the spelling and will not provide the \nalternatives (correct spelling) for a word.  As this plugin depends on the \n'spell' utility, you will not get the correct spelling for a word.  You will \nonly know whether a word is spelled correctly or not.",
  "rating_total": "38",
  "rating_votes": "21",
  "downloads": "2653",
  "install_details": "1. Copy the spell.vim script to the .vim/plugin directory.  Refer to \n   'help add-plugin', 'help add-global-plugin' and 'help runtimepath' for \n   more details. \n2. Modify the s:SpellPath variable, defined at the top of the script,\n   to point to the spell utility path. \n3. Restart Vim.\n\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=4163",
      "filename": "spell.vim",
      "script_version": "1.2",
      "date": "2005-04-13",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Updated the range (of lines) handling. Removed the dependancy on the echo and cat commands."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=645",
      "filename": "spell.vim",
      "script_version": "1.1",
      "date": "2002-02-26",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Added script command description in the comments."
    }
  ]
}
