{
  "script_id": "416",
  "display_name": "Kent Vim Extensions",
  "summary": "Entering folds and other stuff",
  "name": "Kent-Vim-Extensions",
  "script_type": "utility",
  "description": "The purpose of these extensions is to make the use of Vim easier, especially for programming tasks, while preserving the extraordinary features of Vim, which make\nit (imho) one of the best editors available.\n\nThe main part, and probably of most interest for you, is the possibility to enter folds. Entering a fold means to hide everything apart from the fold, so that only the fold you have entered is visible. Thus, you will be able to organise your files much better, and to find and edit certain parts of your files much easier and faster. Especially for long source code files, this is very useful.\n\nThere are also a lot of other features, please check out the help on that by typing\n\n:help kent\n\nafter installation.\n\nNote: These extensions are tested for Vim version 6.1 onwards. No guarantees for lower versions!\n\nThere are the following parts:\n\nKent Folding Extensions:\nExtensions to improve the look and feel of folds.\nEspecially the possibility to enter folds, inspired by the old origami editor, is very useful.\n\nImprovements to the Look and Feel of Vim and GVim:\nThe purpose is to make it easier to use Vim, especially for users without a lot of Vim experience.\n\nKent Programming Extensions:\nExtensions useful for programming tasks.\nFor example commenting out parts of the code depending on the language.\n\nKent occam Extensions:\nExtensions related to the occam language.\nContains syntax and indent files for occam, as well as an easy way to compile, debug and run occam programs.",
  "rating_total": "32",
  "rating_votes": "12",
  "downloads": "930",
  "install_details": "Please go to the Kent Vim Extensions website and follow the instructions.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=3005",
      "filename": "install.txt",
      "script_version": "1.0",
      "date": "2004-05-08",
      "vim_version": "6.0",
      "author": {
        "user_id": "1045",
        "user_name": "informatico",
        "first_name": "Mario",
        "last_name": "Schweigler",
        "email": "ms44 at kent.ac.uk",
        "homepage": "http://www.informatico.de/kent-vim-ext"
      },
      "release_notes": "See file for details."
    }
  ]
}
