{
  "script_id": "471",
  "name": "cream-vimabbrev",
  "summary": "Convert Vim script command and option names between full and abbreviated forms",
  "script_type": "utility",
  "description": "\n*** WARNING! ***\nThis script is very much a work in progress and has several known bugs and likely many unknown ones. You will find little automatic success with it. It is being provided here for information only. Be hereby warned that using these functions will tear valid Vim script limb from limb leaving a trail of crying and gnashing of teeth behind.\n\nThat said, we would very much appreciate your feedback on correcting said anamolies. Feel free to forward suggestions or fixes to:\n  digitect (at) mindspring  com\n\n\nDescription:\n\nThis script is currently one half of a set of functions to convert Vim command and option names between short/abbreviated and long/full name forms. (Ex. \"fu\" => \"function\", \"e\" => \"edit\") These are sometimes indicated like \"fu[nction]\" or  \"e[dit]\".\n\nThe script currently only converts from short to long. Based on my own preferences, I am less motivated to do the other side. ;) But I conceed it would be useful to have a polished routine to help going back and forth between the two for those with preferences for either readability or bandwidth conservation.\n\nThe script contains plenty of working debris at the bottom which shouldn't impact the code above. I have tried to be as complete as possible by using Vim's own syntax and option lists to compile the substitutions from. However you may notice omissions.\n\nDependancies:\n\nmultvals.vim (http://www.vim.org/script.php?script_id=171)\n  by Hari Krishna Dara, for the arrays of items to be substituted.\n\nToDo:\n\n* Avoid mapping syntaxes.\n* Avoid heinous \"normal af|g^\" => \"normal af|global^\" error\n* Avoid heinous \"normal j+r\" => \"normal j+read\" error\n* Add whitespace separators around evaluation operators and concatenation symbols.\n\n\nThis is one of many custom utilities and functions for gVim from the Cream project (http://cream.sourceforge.net), a configuration of Vim for those of us familiar with Apple and Windows software.\n\n",
  "rating_total": "13",
  "rating_votes": "4",
  "downloads": "493",
  "install_details": "\nJust drop this file into your plugins directory, make sure you have the required dependencies (multvals.vim) also there, and start Vim. Then call the functions Cream_vimshort2long() and Cream_vimlong2short() from within the file to be converted.\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1369",
      "filename": "cream-vimabbrev.vim",
      "script_version": "0.1",
      "date": "2002-11-04",
      "vim_version": "6.0",
      "author": {
        "user_id": "430",
        "user_name": "digitect",
        "first_name": "Steve",
        "last_name": "Hall",
        "email": "digitect at mindspring.com",
        "homepage": "http://cream.sourceforge.net"
      },
      "release_notes": "Initial upload"
    }
  ]
}