{
  "script_id": "475",
  "name": "LaTeX-Suite (aka Vim-LaTeX)",
  "summary": "A rich set of tools for editing LaTeX",
  "script_type": "ftplugin",
  "description": "Vim-LaTeX (aka LaTeX-suite) is a mature project which aims at bringing\ntogether the rich set of LaTeX tools the vim community has produced over\nthe years into one comprehensive package. It provides a set of tools\nwhich enable you to do all your LaTeX-ing without needing to quit Vim.\n\nVim-LaTeX has its own web-page at:\n\nhttp://vim-latex.sf.net/\n\nPlease visit there to get the latest version, documentation, screen shots etc.\n\nA brief (not complete) list of the features currently supported by\nVim-LaTeX are as follows:\n\n* Editing:  Latex-Suite ships with a very comprehensive set of insert\n  mode and visual mode mappings and menu items to typeset most of the\n  LaTeX elements. These range from 3 letter insert mode mappings which\n  insert a skeleton of common typesetting elements to visual mode\n  mappings which enclose the selected region in braces, parentheses,\n  etc. The mappings can also be accessed via the menus.\n\n* Compiling: You can compile the tex file from within vim. The list of\n  errors is shown in a quickfix window so you can directly go to the\n  location of an error. The compiler plugin can be dynamically\n  reconfigured to show you more or less warnings.\n\n* Viewing: By pressing a key from within vim, the .dvi viewer is started\n  up. You can also do forward and inverse searching on your .dvi file\n  from within vim.\n\n* Folding: Latex-suite ships with the plugin SyntaxFolds.vim which is\n  a plugin for creating \"fake\" syntax folds on the fly. The fold method\n  is actually manual but the folding is based on LaTeX syntax. This\n  offers a speed increase over regular syntax folding. When you open up\n  a LaTeX file, all the portions will be automatically folded up.\n\n* Packages: This module provides ways of customizing the menus based on\n  which packages are being used in the current LaTeX file. When\n  latex-suite first starts up, it scans the latex-master-file for\n  \\usepackage{name} lines and if the corresponding package is found in\n  the latex-suite/packages/ directory, then creates a sub-menu based on\n  the specification found in that file. See the list of currently\n  supported packages.\n\n* LaTeX help file: Latex-suite ships with the standard texinfo file\n  translated into vim help format so that you can get help for common\n  latex commands from within vim. You can view the html version of this\n  file here.\n\n* Dictionary: Latex-suite ships with a dictionary with over 600 LaTeX\n  commands, which speeds up typing using the CTRL-X_d command of vim.\n\n* Customized Templates: Latex-suite ships with some commonly used latex\n  templates. It is trivial to add your own templates. The templates can\n  contain dynamic data such as time of creation etc. See list of current\n  templates.\n\n* Customized Macros: Latex-suite makes it easy to add custom macros,\n  again with the possibility of dynamic content and automatic cursor\n  placement.\n\n\nSee\n\nhttp://vim-latex.sf.net/index.php?subject=weare\n\nfor the list of maintainers / how to contact us.Vim-LaTeX is currently maintained\nby\n\nSrinath Avadhanula\nMikolaj Machowski\nBenji Fisher\n\n",
  "rating_total": "817",
  "rating_votes": "240",
  "downloads": "5134",
  "install_details": "The installation instructions (along with the latest stable versions of\nLaTeX-suite) are maintained at:\n\nhttp://vim-latex.sf.net/index.php?subject=download\n\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=2535",
      "filename": "latexSuite-1.5.tar.gz",
      "script_version": "1.5",
      "date": "2003-12-01",
      "vim_version": "6.0",
      "author": {
        "user_id": "247",
        "user_name": "srinath.avadhanula",
        "first_name": "Srinath",
        "last_name": "Avadhanula",
        "email": "srinath at fastmail.fm",
        "homepage": "http://robotics.eecs.berkeley.edu/~srinath/index.html"
      },
      "release_notes": "A vastly improved and bug-fixed version of latex-suite.\n\nSee \nRelease Notes: http://vim-latex.sourceforge.net/download/RELEASE-1.5.txt\nChangelog: http://vim-latex.sourceforge.net/vimfiles/ftplugin/latex-suite/ChangeLog\n\nNOTE: The Changelog at this moment suffers from excessive verbosity since it is            automatically generated.\n\nPlease note that releases are made much more regularly on the vim-latex download page at:\n\nhttp://vim-latex.sourceforge.net/index.php?subject=download&title=Download"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1384",
      "filename": "latexSuite.zip",
      "script_version": "1.0",
      "date": "2002-11-07",
      "vim_version": "6.0",
      "author": {
        "user_id": "247",
        "user_name": "srinath.avadhanula",
        "first_name": "Srinath",
        "last_name": "Avadhanula",
        "email": "srinath at fastmail.fm",
        "homepage": "http://robotics.eecs.berkeley.edu/~srinath/index.html"
      },
      "release_notes": "Initial upload"
    }
  ]
}