{
  "script_id": "505",
  "name": "python_box.vim",
  "summary": "menu and easy navigation for python files",
  "script_type": "ftplugin",
  "description": "Parts of this script (as indicated in the code) were taken from python.vim,\ncopyright 2001 Mikael Berthe <mikael.berthe@efrei.fr>.\n\nThe script brings together shortcuts and a menu to syntax check \nthe current file (using the compilerscript for python, python.vim),\nsome functionality for quickly finding one's way through classes \nand functions of a python file (without using exuberant ctags),\nsome of the nice functionality from Mikael Berthe's python.vim\nas well as menu access to some of Benji Fisher's python_match.vim.\n\n---------------------------------------------------------------------------\nSome hints on how to use\n---------------------------------------------------------------------------\nThe buffer TOC offers a outline of all Python classes and functions of the\ncurrent buffer in a seperate vim window. The cursor position in the TOC window\nindicates where you are in the original Window containing the Python code. \nPress <F5> again (or q) to quit that window without changing the cursor \nposition in the original window (containing the Python code).\nThat I find practical when editing a Python file and getting confused \nabout where I am.\nIf you want to change your position in the Python file:\nSet the cursor in the TOC window to the class/function you want to jump to \nthen press <RETURN> to go there.\nIf the TOC windows is split pressing <SPACE> will navigate to the\nclass/function but the TOC window will remain open and will keep the focus.\nDoubleclicking the left mousebutton will have the same effect.\nHowever if the window is not split left doublclicking or pressing <SPACE>\nwill have the same effect as pressing <RETURN>.\nOnce the TOC-window looses its focus it is closed immediately so to be out of\nthe way.\n",
  "install_details": "just source or put in ftplugin directory.\n\nPlease note that this script needs the python compilerscript \"python.vim\" as well as \"python_match.vim\" by Benji Fisher. Both are to be found here among the uploaded scripts. The former should be put in the compiler script directory, the latter should be sourced or placed in the ftplugin directory. ",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1688",
      "filename": "python_box.vim",
      "script_version": "0.5",
      "date": "2003-02-01",
      "vim_version": "6.0",
      "author": {
        "user_id": "1229",
        "user_name": "ccf",
        "first_name": "Christoph",
        "last_name": "Herzog",
        "email": "ccf.herzog at gmx.net",
        "homepage": ""
      },
      "release_notes": "Some syntax highlighting was added for the outlinebuffer. I think it improves readability here as well.\n\nThe outlinebuffer was not always reliably removed when it lost the focus etc. Hopefully this is now fixed."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1517",
      "filename": "python_box.vim",
      "script_version": "0.4",
      "date": "2002-11-30",
      "vim_version": "6.0",
      "author": {
        "user_id": "1229",
        "user_name": "ccf",
        "first_name": "Christoph",
        "last_name": "Herzog",
        "email": "ccf.herzog at gmx.net",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}