{
  "script_id": "521",
  "display_name": "mru.vim",
  "summary": "Plugin to manage Most Recently Used (MRU) files",
  "name": "mru.vim",
  "script_type": "utility",
  "description": "Overview\n\nThe Most Recently Used (MRU) plugin provides an easy access to a list of\nrecently opened/edited files in Vim. This plugin automatically stores the\nfile names as you open/edit them in Vim.\n\nThis plugin will work on all the platforms where Vim is supported. This\nplugin will work in both console and GUI Vim. This version of the MRU\nplugin needs Vim 7.0 and above. If you are using an earlier version of\nVim, then you should use an older version of the MRU plugin.\n\nThe recently used filenames are stored in a file specified by the Vim\nMRU_File variable.\n\nUsage\n\nTo list and edit files from the MRU list, you can use the \":MRU\" command.\nThe \":MRU\" command displays the MRU file list in a temporary Vim window.  If\nthe MRU window is already opened, then the MRU list displayed in the window\nis refreshed.\n\nIf you are using GUI Vim, then the names of the recently edited files are\nadded to the \"File->Recent Files\" menu. You can select the name of a file\nfrom this sub-menu to edit the file.\n\nYou can use the normal Vim commands to move around in the MRU window. You\ncannot make changes in the MRU window.\n\nYou can select a file name to edit by pressing the <Enter> key or by double\nclicking the left mouse button on a file name.  The selected file will be\nopened. If the file is already opened in a window, the cursor will be moved\nto that window. Otherwise, the file is opened in the previous window. If the\nprevious window has a modified buffer or is the preview window or is used by\nsome other plugin, then the file is opened in a new window.\n\nYou can press the 'o' key to open the file name under the cursor in the\nMRU window in a new window.\n\nTo open a file from the MRU window in read-only mode (view), press the 'v'\nkey.\n\nTo open a file from the MRU window in a new tab, press the 't' key.  If the\nfile is already opened in a window in the current or in another tab, then\nthe cursor is moved to that tab. Otherwise, a new tab is opened.\n\nYou can open multiple files from the MRU window by specifying a count before\npressing '<Enter>' or 'v' or 'o' or 't'. You can also visually select\nmultiple filenames and invoke the commands to open the files. Each selected\nfile will be opened in a separate window or tab.\n\nYou can press the 'u' key in the MRU window to update the file list. This is\nuseful if you keep the MRU window open always.\n\nYou can close the MRU window by pressing the 'q' key or using one of the Vim\nwindow commands.\n\nTo display only files matching a pattern from the MRU list in the MRU\nwindow, you can specify a pattern to the \":MRU\" command. For example, to\ndisplay only file names containing \"vim\" in them, you can use the following\ncommand \":MRU vim\".  When you specify a partial file name and only one\nmatching filename is found, then the \":MRU\" command will edit that file.\n\nThe \":MRU\" command supports command-line completion of file names from\nthe MRU list. You can enter a partial file name and then press <Tab>\nor <Ctrl-D> to complete or list all the matching file names. Note that\nafter typing the \":MRU\" command, you have to enter a space before completing\nthe file names with <Tab>.\n\nWhen a file supplied to the \":MRU\" command is not present in the MRU list,\nbut it is a readable file, then the file will be opened (even though it is\nnot present in the MRU list). This is useful if you want to open a file\npresent in the same directory as a file in the MRU list. You can use the\ncommand-line completion of the \":MRU\" command to complete the full path of a\nfile and then modify the path to open another file present in the same path.\n\nWhenever the MRU list changes, the MRU file is updated with the latest MRU\nlist. When you have multiple instances of Vim running at the same time, the\nlatest MRU list will show up in all the instances of Vim.\n\nConfiguration\n\nBy changing the following variables you can configure the behavior of this\nplugin. Set the following variables in your .vimrc file using the 'let'\ncommand.\n\nThe list of recently edited file names is stored in the file specified by the\nMRU_File variable.  The default setting for this variable is\n$HOME/.vim_mru_files for Unix-like systems and $USERPROFILE/_vim_mru_files\nfor MS-Windows systems. You can change this variable to point to a file by\nadding the following line to the .vimrc file:\n\n      let MRU_File = 'd:\\myhome\\_vim_mru_files'\n\nBy default, the plugin will remember the names of the last 100 used files.\nAs you edit more files, old file names will be removed from the MRU list.\nYou can set the 'MRU_Max_Entries' variable to remember more file names. For\nexample, to remember 1000 most recently used file names, you can use\n\n      let MRU_Max_Entries = 1000\n\nBy default, all the edited file names will be added to the MRU list. If you\nwant to exclude file names matching a list of patterns, you can set the\nMRU_Exclude_Files variable to a list of Vim regular expressions. By default,\nthis variable is set to an empty string. For example, to not include files\nin the temporary (/tmp, /var/tmp and d:\\temp) directories, you can set the\nMRU_Exclude_Files variable to\n\n      let MRU_Exclude_Files = '^/tmp/.*\\|^/var/tmp/.*'  \" For Unix\n      let MRU_Exclude_Files = '^c:\\\\temp\\\\.*'           \" For MS-Windows\n\nThe specified pattern should be a Vim regular expression pattern.\n\nIf you want to add only file names matching a set of patterns to the MRU\nlist, then you can set the MRU_Include_Files variable. This variable should\nbe set to a Vim regular expression pattern. For example, to add only .c and\n.h files to the MRU list, you can set this variable as below:\n\n      let MRU_Include_Files = '\\.c$\\|\\.h$'\n\nBy default, MRU_Include_Files is set to an empty string and all the edited\nfilenames are added to the MRU list.\n\nThe default height of the MRU window is 8. You can set the MRU_Window_Height\nvariable to change the window height.\n\n      let MRU_Window_Height = 15\n\nBy default, when the :MRU command is invoked, the MRU list will be displayed\nin a new window. Instead, if you want the MRU plugin to reuse the current\nwindow, then you can set the 'MRU_Use_Current_Window' variable to one.\n\n      let MRU_Use_Current_Window = 1\n\nThe MRU plugin will reuse the current window. When a file name is selected,\nthe file is also opened in the current window.\n\nWhen you select a file from the MRU window, the MRU window will be\nautomatically closed and the selected file will be opened in the previous\nwindow. You can set the 'MRU_Auto_Close' variable to zero to keep the MRU\nwindow open.\n\n      let MRU_Auto_Close = 0\n\nIf you don't use the \"File->Recent Files\" menu and want to disable it,\nthen you can set the 'MRU_Add_Menu' variable to zero. By default, the\nmenu is enabled.\n\n      let MRU_Add_Menu = 0\n\nIf too many file names are present in the MRU list, then updating the MRU\nmenu to list all the file names makes Vim slow. To avoid this, the\nMRU_Max_Menu_Entries variable controls the number of file names to show in\nthe MRU menu. By default, this is set to 10. You can change this to show\nmore entries in the menu.\n\n      let MRU_Max_Menu_Entries = 20\n\nIf many file names are present in the MRU list, then the MRU menu is split\ninto sub-menus. Each sub-menu contains MRU_Max_Submenu_Entries file names.\nThe default setting for this is 10. You can change this to increase the\nnumber of file names displayed in a single sub-menu:\n\n      let MRU_Max_Submenu_Entries = 15\n",
  "install_details": "1. Copy the mru.vim file to one of the following directories:\n\n      $HOME/.vim/plugin     - Unix like systems\n      $HOME/vimfiles/plugin - MS-Windows\n      $VIM:vimfiles:plugin  - Macintosh\n      $VIM/vimfiles/plugin  - All\n\n   Refer to the following Vim help topics for more information about Vim\n   plugins:\n\n      :help add-plugin\n      :help add-global-plugin\n      :help runtimepath\n\n2. Set the MRU_File Vim variable in the .vimrc file to the location of a\n   file to store the most recently edited file names. This step is needed\n   only if you want to change the default MRU filename.\n3. Restart Vim.\n4. You can use the \":MRU\" command to list and edit the recently used files.\n   In GUI Vim, you can use the 'File->Recent Files' menu to access the\n   recently used files.\n\nTo uninstall this plugin, remove this file (mru.vim) from the\n$HOME/.vim/plugin or $HOME/vimfiles/plugin or the $VIM/vimfile/plugin\ndirectory.\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=11919",
      "filename": "mru.vim",
      "script_version": "3.3",
      "date": "2009-12-18",
      "vim_version": "7.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "* Limit the number of file names displayed in the MRU menu. Provide a configuration variable for selecting the number of file names displayed in the MRU menu or in the sub-menu.\n* Add a menu accelerator for the Recent Files menu.\n* Add the \":Mru\" command (alias for the \":MRU\" command) for ease of use.\n* When a file not present in the MRU list is supplied to the \":Mru\" command, then open the file.\n* Add 'v' command to edit a file from the MRU list as read-only.\n* Increase the default MRU list size to 100 from 10.\n* Support for opening multiple files from the MRU list.\n"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9274",
      "filename": "mru.vim",
      "script_version": "3.2",
      "date": "2008-09-23",
      "vim_version": "7.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Escape special characters in filenames for security reasons. On MS-Windows, use the _vim_mru_files file from the $USERPROFILE directory. When the ':vimgrep' command is used, don't add the files to the MRU list. When getting the files matching a pattern, first try it as a literal string. Show tooltip text for MRU menu entries."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=8292",
      "filename": "mru.vim",
      "script_version": "3.1",
      "date": "2008-02-17",
      "vim_version": "7.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Support for completion of filenames from the MRU file list for the :MRU command. Split the MRU menu into submenus when a large number of filenames are present in the MRU list. Fix for the placement of the MRU menu when Vim is running in compatible mode. New option to disable the MRU menu. The :MRUedit command is replaced by the :MRU command.\n"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=8148",
      "filename": "mru.vim",
      "script_version": "3.0",
      "date": "2008-01-12",
      "vim_version": "7.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Works only with Vim version 7.0 and above. Uses Vim 7.0 data structures and functions. Support for opening files in tabs. Support for displaying files matching a pattern in the MRU window."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=7851",
      "filename": "mru.vim",
      "script_version": "2.5",
      "date": "2007-10-31",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Use <abuf> instead of <afile> in autocmds. Escape backslash while searching for partial filenames."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6352",
      "filename": "mru.vim",
      "script_version": "2.4",
      "date": "2006-10-30",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Escape the % and # characters in the MRU filenames. Don't open a selected file in the preview window or in a window used by a Vim plugin."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=5798",
      "filename": "mru.vim",
      "script_version": "2.3",
      "date": "2006-06-03",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Escape single quote characters in filenames. Use exact match while searching for open files."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=5788",
      "filename": "mru.vim",
      "script_version": "2.2",
      "date": "2006-05-30",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "1. Save the list of MRU files to the MRU db file as soon as the list is changed.\n2. Escape space characters in file names.\n3. Add the :MRUedit command to edit files from the MRU list."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=4235",
      "filename": "mru.vim",
      "script_version": "2.1",
      "date": "2005-05-03",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Fixed a problem with handling space characters in the name of the MRU file. Modified the plugin to work in Vi compatible mode."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=4084",
      "filename": "mru.vim",
      "script_version": "2.0",
      "date": "2005-03-26",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Fixed the problem with one Vim session overwritting the MRU list from another Vim session. Added the MRU file list to the File menu in GUI Vim. Instead of using a Vim global variable to store the MRU list, used a separate file to store the MRU list."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=2172",
      "filename": "mru.vim",
      "script_version": "1.6",
      "date": "2003-07-19",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Fixed the following bugs: Some filenames are added more than once to the MRU list and the MRU window is not closed when a file which already opened in one of the windows is selected from the MRU window."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=2124",
      "filename": "mru.vim",
      "script_version": "1.5",
      "date": "2003-07-02",
      "vim_version": "6.0",
      "author": {
        "user_id": "244",
        "user_name": "yega",
        "first_name": "Yegappan",
        "last_name": "Lakshmanan",
        "email": "yegappan at yahoo.com",
        "homepage": ""
      },
      "release_notes": "Open the selected file from the MRU list in the window from which the MRU window was opened."
    }
  ]
}
