{
  "script_id": "554",
  "display_name": "mruex",
  "summary": "Explore your most recently used (MRU) files",
  "name": "mruex",
  "script_type": "utility",
  "description": "mruex.vim maintains a list (in a file called mrulist) of your most recently used files. mruex.vim presents an explorer-like interface to mrulist so that you can easily open your MRU files. Duplicates and files that are no longer readable are pruned from mrulist whenever an entry is added to mrulist. If you have several instances of Vim running simultaneously, each update to the mrulist becomes available immediately in all the Vim instances. \n\nUsage:\nA mrulist window is opened by the command :RSplit or <Leader>r where <Leader> is \\ by default. Five commands are available in the mrulist window:\nKey         Action:\nh              Toggle help\nEnter       Open file\no              Open file in new window\nd              Delete entry (not file)\nq              Close mrulist window\n\nCustomization is done via five Vim variables. mruex_key (default '<Leader>r')\tis the key to open the mrulist window, mruex_win_height (default 6) is the height of the mrulist window, mruex_max_entries (default 20) is the maximum number of MRU file names to keep in mrulist excluding duplicates, mruex_type (default 'w') controls the meaning of most recently used. 'w' indicates: Add file to mrulist whenever it is \twritten (saved) to disk. 'e' indicates: add file to mrulist whenever it is entered, and mruex_filter (default '') is a Vim regular expression defining files to be excluded from the mrulist. mruex_relative =1 or 0 determines  whether or not the file paths in the mrulist are relative to $HOME. \nThe default is mruex_relative=1 for unix systems and 0 for others.\nExamples:\n\tlet mruex_filter='d:\\\\temp\\&#039\nin your vimrc excludes files in the d:\\temp\\ directory from the mrulist.\n\tlet mruex_key='<f3>'\nin your vimrc sets F3 as the key that opens the mrulist window.",
  "rating_total": "54",
  "rating_votes": "26",
  "downloads": "1443",
  "install_details": "Just place this file in $HOME\\vimfiles\\plugin for MSWindows or $HOME/.vim/plugin for Unix. The mrulist file will be created in $HOME\\vimfiles or $HOME/.vim respectively. mruex.vim requires Vim 6.0 (or later) run with \"set nocompatible\" in the vimrc.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1971",
      "filename": "mruex.vim",
      "script_version": "1.4",
      "date": "2003-05-07",
      "vim_version": "6.0",
      "author": {
        "user_id": "1263",
        "user_name": "ajit",
        "first_name": "Ajit",
        "last_name": "Thakkar",
        "email": "ajit at unb.ca",
        "homepage": "http://www.unb.ca/chem/ajit/vim.htm"
      },
      "release_notes": "As requested by some MSWindows users, the default behavior has been changed to use full file paths in the mrulist except for Unix systems where file paths are made relative to $HOME. A new global variable, mruex_relative, lets you modify this behavior to suit your needs. "
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1890",
      "filename": "mruex.vim",
      "script_version": "1.3",
      "date": "2003-04-03",
      "vim_version": "6.0",
      "author": {
        "user_id": "1263",
        "user_name": "ajit",
        "first_name": "Ajit",
        "last_name": "Thakkar",
        "email": "ajit at unb.ca",
        "homepage": "http://www.unb.ca/chem/ajit/vim.htm"
      },
      "release_notes": "Restore numbered registers after MruUpdate (Ivan Tarasov). Use has(\"patch...\") etc. to automatically include enhancements that depend on patches to vim6.1"
    }
  ]
}
