{
  "script_id": "610",
  "display_name": "ctags.vim -- Johnson",
  "summary": "Display function name in the title bar and/or the status line",
  "name": "ctags.vim--Johnson",
  "script_type": "utility",
  "description": "This is a new version of Alexey Marinichev&#039s ctags.vim script, vimscript #12. I have modified it with the author&#039s permission, but cannot upload it as a new version of the original script because Vim Online now allows only the original author to do that.\n\nThe original script used exuberant ctags to build a list of tags for the current file and displayed the name of the function the cursor was in (actually the name of the tag at or above the cursor&#039s line) in the title bar.\n\nThis version has been modified to display the function/tag name in the status line instead of or in addtion to the title bar.  If multiple windows are open, the correct function/tag name is displayed in each status line. The script has also been modified to be a plugin instead of having to be sourced. Finally, since exuberant ctags now supports Python and Vim languages as well as C, .py and .vim were added to the list of suffixes that automatically start the script.\n\nNew in Version 2.1\n------------------\n\n1.  Keith Reynolds contributed some changes that have made a dramatic improvement in the startup time when opening large files containing many tags.  The improvement is greatest when using a vim compiled with Perl support.  His changes also result in this version using less memory than version 2.0.\n\n2.  Keith also added automatic enabling of the status line (i.e., setting 'statusline' to 2) when entering a buffer in which the script is active.\n\n3.  The default g:ctags_args value has been changed to use C and vim type values more appropriate for this plugin.  If you prefer the previous defaults, the values are still noted in the script and can be used instead by setting them yourself in your ~/.vimrc.\n\n4.  The default g:ctags_path value has been changed to be better for most users.  This can also be reverted to the previous default value by looking in the script for the previous setting and putting this in your ~/.vimrc.\n\n5.  The ctags database is now regenerated every time a buffer is saved.  This keeps the database up to date as a file is changed.  If this is a performance problem for you, just add\n\n        let g:ctags_regenerate = 0\n\nto your ~/.vimrc.\n\n6.  The behavior of the cursor when moving vertically through text has been improved.  It no longer \"forgets\" the column to which it was last set as often.  It may forget now only when the tag name changes.\n\n7.  Configuration varaibles may now be set at any time, not just at vim startup time.\n",
  "install_details": "Copy ctags.vim to your plugin directory.\n\nIf the ctags program is not in your PATH, you will need to add the following to your vimrc:\n\n    let g:ctags_path=<path to your ctags>\n\nand to enable the display of function names in the status line, you will need to add this:\n\n    let g:ctags_statusline=1\n\nOther configuration variables you may want to change are:\n\n    g:ctags_args\n        Additional arguments to the ctags program.\n\n    g:ctags_title\n        Set to 1 if you want the function name also displayed in the title bar.\n        This is the default, but if g:ctags_statusline is set to 1, this must also be\n        set to one to show the function name in the title bar. Otherwise, the\n        function name appears only in the status line.\n\n    generate_tags\n        Set to 1 if you want the script to be started automatically for the supported\n        file types (actually file extensions). Otherwise the script must be started\n        manually with the CTAGS command.\n\n    g:ctags_regenerate\n        Set to 0 if you don't want the tags database rebuilt each time\n        the buffer is written.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=2529",
      "filename": "ctags.vim",
      "script_version": "2.1",
      "date": "2003-11-29",
      "vim_version": "6.0",
      "author": {
        "user_id": "1301",
        "user_name": "garyjohn",
        "first_name": "Gary",
        "last_name": "Johnson",
        "email": "gjohnson at spocom.com",
        "homepage": ""
      },
      "release_notes": "Improved the startup time and memory usage.  Automatically turn the status line on when displaying the tag name in the status line.  Both of those features were contributed by Keith Reynolds.  Changed the types of tags displayed for C and vim files.  Added updating of the ctags database when a file is written.  Mostly fixed a problem where the script caused the cursor to not remember its column position as it was moved vertically.  Details on the script page."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1888",
      "filename": "ctags.vim",
      "script_version": "2.0",
      "date": "2003-04-02",
      "vim_version": "6.0",
      "author": {
        "user_id": "1301",
        "user_name": "garyjohn",
        "first_name": "Gary",
        "last_name": "Johnson",
        "email": "gjohnson at spocom.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
