{
  "script_id": "625",
  "name": "Color Sampler Pack",
  "summary": "*NEW* [Jan 2010 Update] Top 100 Themes, GUI Menu",
  "script_type": "color scheme",
  "description": "This package is simply to help people who want to try out a lot of color schemes.  It is the top 100 rated color schemes on vim.sf.net as of Jan 20th, 2010 that are are not \"evil\" (binding keys, changing fonts, etc) --  zipped up in a single package.  Every single theme was updated to its newest revision, and converted to unix formatted line endings. \n\nCheck out a demo of these themes at: http://www.vi-improved.org/color_sampler_pack/\n\nThe menu has been simplified based on feedback to simply three categories.  Dark / Light / Other. \n\nThis package was put together simply to save others time in downloading the color schemes.  If you are a scheme author and for some reason do not want your scheme included, please simply drop me a note.  iam -at- robertmelton.com\n\nNow, the pack comes with an organized GUI menu, but no tool for console users.  I recommend you pick up http://www.vim.org/scripts/script.php?script_id=1488 which is a colorscheme scroller / chooser and browser.  \n\nMany of these schemes are Gvim only, and do not support consoles well... but there is a plugin to allow Gvim only themes to work in 88/256 color terminals -> http://www.vim.org/scripts/script.php?script_id=2390.\n\nLove it or Hate it -- Rate it.  :)",
  "rating_total": "2060",
  "rating_votes": "776",
  "downloads": "43757",
  "install_details": "Simply unzip, and place the files in ~/.vim/plugin and ~/.vim/colors --- it will unzip with correct dir structure, so you can just unzip to ~/.vim\n\nHope this helps you... join #vim on irc.freenode.net for all your vim help needs :)",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12179",
      "filename": "ColorSamplerPack.zip",
      "script_version": "8.03",
      "date": "2010-01-25",
      "vim_version": "7.0",
      "author": {
        "user_id": "2162",
        "user_name": "metacosm",
        "first_name": "Robert",
        "last_name": "(MetaCosm)",
        "email": "vim at metacosm.dhs.org",
        "homepage": "http://vi-improved.org"
      },
      "release_notes": "[Jan 2010 Update] 30 new themes climbed into the top 100, which means 30 were deprecated.  Online demo of themes at: http://www.vi-improved.org/color_sampler_pack/ .  Total theme count, 137 (that is 100 themes, some of them have multiple sub-versions)\n"
    }
  ]
}