{
  "script_id": "633",
  "name": "Reindent",
  "summary": "Reindent a complete file based on indent information taken out of indent file.",
  "script_type": "utility",
  "description": "If you like well formatted files use this plugin to chage the indention of a complete file.\n\nAnnotations:\nThe indention information is taken out of the VIM Indent-files. This\nscript processes them in a little different way than vim itself, therefore\nit is possible that the indent-functions have to be rewritten before they \nwork.\nThis script tries to rewrite the indent functions automatically (during \nthis a file \"reindent.tmp\" will be created in your current working \ndirectory).\nThere may be indent functions out there that don't work with this script  because they are too complex to be rewriten automatically with my \ncode.\n                                                                                \nPreconditions:\n- A indent function has to exist for your current file (indentexpr is set)\n- Your current working directory has to be writable if Indent-function has to be rewritten.\n\nUsage:\n1. Copy this file to your plugin directory\n2. start vim with i.E. a HTML-File\n3. Hit <Lead>R (If you don't know what <Leader> is read :help leader \n    or press \\R to reindent).\n    If using menus you will find a new menu item \"Reindent\" in menu \n    \"Syntax\".\n4. Customize the Keystroke with an Entry in your .vimrc i.E.:\n    map ff <Plug>reindent \" call reindent by pressing ff",
  "install_details": "Copy this file to your plugin directory\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=1962",
      "filename": "reindent.vim",
      "script_version": "1.0",
      "date": "2003-05-02",
      "vim_version": "6.0",
      "author": {
        "user_id": "2251",
        "user_name": "joergtretter",
        "first_name": "Jörg",
        "last_name": "Tretter",
        "email": "j.tretter at gmx.de",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}