{
  "script_id": "821",
  "name": "BlockWork",
  "summary": "Adjust list numbering (increment) and other work with (visual) block selections",
  "script_type": "utility",
  "description": "Function to Work with Selected Blocks --\nIncludes vmap assignments for incrementing, decrementing, and re-sequencing integers in a selected block.\n\nPurpose:\nSimplifies editing numbered lists or other sequences of numbers.  \nIncludes function to apply most any command to a selected 'visual block' of text.\n\nJustification:\nVim includes CTRL-A and CTRL-X to add and subtract from integers under the cursor, however neither of these works on selections.\nThere are search and replace techniques to handle multiple changes on a range of lines (e.g. s/-\\?\\d\\+/\\=submatch(0)+1/g').\nHowever, this won't work on a 'visual block' selection.\n\nExample:\nThe first item was deleted from the following list,\nand you want to decrement all the numbers by 1.\n     2) show 35\n     3) show 19\n     4) show 85\n     ...\n   134) show 12\nUsing this plugin, you would position the cursor on the 2, \nselect the column of numbers, and decrement -- i.e. type:\n   <C-V>132jb<C-X> \n(where <C-V> and <C-X> are CTRL-V and CTRL-X respectively)\n\nRe-sequencing (To Automatically Correct A Sequence):\nThere is also a feature to re-sequence a selection of numbers (automatically eliminating all missing numbers).  Note that I've mapped the re-sequence function to <M-S-A> and <M-S-X>  (that's Alt plus Shift and A or X).  (The functional interface within the script allows easy adaptation for other scripters.)\n\nIssues and challenges with the techniques employed are discussed in the file.\n\n---\n2005-09-02: When I created this, I had imagined that I would update it a some point, but \nit has served me well since I had created it.  I mostly use this script to re-sequence numbers.\n\nNote that there are now at least four scripts that perform this functionality.\nvimscript #670 - visincr.vim - Charles E Campbell (along with vimtip #150, handles dates!!!)\nvimscript #145 - increment.vim - Stanislav Sitar\nvimscript #156 - increment.vim - Srinath Avadhanula\nvimscript #842 - increment.vim - William Natter (sequences on a substitution character)\nvimscript #189 - renumber.vim - Neil Bird (only re-sequences, but handles hex)\nvimscript #821 - blockwork.vim - John Aldridge\nvimscript #1046 - monday.vim - Stefan Karlsson (increments month and weekday names)\n\nSpeak up if there are others.",
  "rating_total": "1",
  "rating_votes": "5",
  "downloads": "622",
  "install_details": "To use this file as a plugin, place it in the plugin directory.\nTo just try it out, download it anywhere and open it with Vim.\nThere are only four mapping assignments, which should be un-obtrusive (but they can be easily changed).\nAdditional instructions are at the beginning of the file.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=2488",
      "filename": "blockwork.vim",
      "script_version": "0.0",
      "date": "2003-11-13",
      "vim_version": "6.0",
      "author": {
        "user_id": "1404",
        "user_name": "jaldri",
        "first_name": "John",
        "last_name": "Aldridge",
        "email": "jaldri.bs at comcast.net",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
