{
  "script_id": "957",
  "display_name": "YAPosting",
  "summary": "Yet Another Posting script",
  "name": "YAPosting",
  "script_type": "utility",
  "description": "This script was designed in order to have a simple but reliable, comprehensive and reusable set of mappings, functions and syntax in order to improve the Mailing and Posting edition. It does 'clean' the quotes in the mail (removes empty quoted lines, condense quote signs and remove signature), it changes Microsoft Outlook Express quote header to a standard quote header and put the quote where it belongs, it can remove quoted or not quoted paragraphs and it can reformat your text into \na justified text inside margins.\n\nThere still are some minor Bugs which I'll get rid of one day, and some feature I shall add to it... But obviously, time is not extensible, and I don't know when I'll have enough to really make this script perfect... Anyway, I'm using this script every day when I edit E-Mails, and I really enjoy using it. :)\n\nI'd also like to thanks Luc Hermitte who made a good critic of my script.\n\nUSAGE :\nthe default keybindings are :\n    tc : clean the mail (removes empty quoted lines, removes signature...)\n    tm : move a MS/OE signature to the top of the quotation, and change the quotation tag.\n           note: since MS/OE has evolved, that feature may not work as well as in 2004.\n    tt : takeout a paragraph (or a quoted paragraph)\n         you will be prompt to enter a reason to put inside the square brackets (like [snip])\n    tr : reformat the current paragraph in order to have it belonging your formating rules\n          (you can change them by editing the script, or changing global variables :\n            g:par_marginleft\n            g:par_marginright\n            g:par_textwidth\n            g:par_alinea\n           )\n    th : toggle highlighting of 72 and 80 columns limits \n          (texts after 72 column will appear yellow, and after 80 will appear red). \n          note: has to be deprecated to support new vim 7 features\n    tn : added 'cut here' lines into your mail (new in v0.2) :\n-------8<----------8<--------\ntext\n------->8---------->8--------\n         \nNB:\nThis script offers a similar, yet different way to Justify a text than : http://www.vim.org/scripts/script.php?script_id=177\n",
  "install_details": "You need to have perl v5.8.3 or compatible.\nTo install the script, copy it in ~/.vim/ and type ':call YAPConfPerl()' (or install Text::Format from CPAN).\nThen, read the script's source in the documentation to configure the variables and the mappings",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=15470",
      "filename": "yaposting.vim",
      "script_version": "0.2",
      "date": "2011-04-18",
      "vim_version": "6.0",
      "author": {
        "user_id": "4881",
        "user_name": "guyzmo",
        "first_name": "Bernard",
        "last_name": "PRATZ",
        "email": "bernard@pratz.net",
        "homepage": "http://bernard.pratz.net"
      },
      "release_notes": "* Added support for utf-8 encoded characters for the justify format feature\n* Added '<Lead>n' shortcut to add \"cut here\" marks :\n-----8<-----8<-----\n----->8----->8-----\n* Verified support for vim >7 (verified with 7.1) but shall work with older vims.\nTODO\n* Need to be improved to be more vim script compliant (better use of <Lead>, of function declaration, use of range etc...)\n* Need to have better support of typographic rules (don't add spaces around quotes for example when justifying the text)\n* Need to improve OE quote fixing rules..."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=2920",
      "filename": "yaposting.vim",
      "script_version": "0.1",
      "date": "2004-04-07",
      "vim_version": "6.0",
      "author": {
        "user_id": "4881",
        "user_name": "guyzmo",
        "first_name": "Bernard",
        "last_name": "PRATZ",
        "email": "bernard@pratz.net",
        "homepage": "http://bernard.pratz.net"
      },
      "release_notes": "Initial upload"
    }
  ]
}
