{
  "script_id": "966",
  "display_name": "asmx86",
  "summary": "A Simple x86-ASM syntax for VIM",
  "name": "asmx86",
  "script_type": "syntax",
  "description": "This is a simple X86 assembly language syntax for VIM.  It's fairly indiscriminant about the assembler syntax you choose to use.  It recognises the mnemonics for \"classic\" intel opcodes, and the GNU (gas) \"mode\" characters appended to these opcodes.  This syntax script contains all known opcodes for the i486 instruction set, and register set.  \n\nHistory:\nThis syntax was hacked using the asm-m68k syntax as a starting point.  (I built this using my intel 486 System Programmer Manual as a reference.)  Because I do a great deal of hacking on assembly language, for several architectures, I felt that a proper (Or at least somewhat better than all-cyan... ;-) syntax highlighting for each one was in order.  Because (at this time), I hack a lot on x86 ASM, I've whipped this up, to help me work on it.  This would not have been possible without several good scripts (C, C++, and m68kASM) to use as starting points, and to rip code from.\n\nDetails:\n\nIt is aware of the \"arcane\" instructions for dealing with protected memory activities.  It is also aware of the \"CR\", \"DR\", and \"TR\" register sets.  The syntax does not, at this time, check for validity of operands to your opcodes (To do so would make it unable to be assembler independant.)  It does not know about the conditional jump mnemonics however.  (It merely considers any j.{1,5} string to be a valid jump.)  \n\nThe FPU instruction set is only partially recognised at this time.  \n\nThe colour scheme is a bit over-done, perhaps, but I find it useful when debugging some complex projects.  (I've divided the opcodes into several classes... I/O, mov's, arithmetic, branching, other.)  \n\nI don't really change it much.  I whipped it up, because I needed some good colour highlighting on my editing of x86 code.  As such, I don't expect to maintain it.  If anyone does wish to take over the maintanance of it, or improve it in any way, I'd be much appreciative.\n\nKnown Bugs:\n\nIt gets a bit quirky sometimes on complex nesting of comment types.  The syntax is CPP aware, and tries to \"grey-out\" #if 0, etc.  If nesting several classes of comment, or placing your code shortly after a few variations of comment, you'll possibly have commented lines get syntax highlighted, or your uncommented lines get highlighted as comments.  I've not really figured out why.  A simple \"^L\" to force a redraw seems to solve the problem in any case, so it may just be a bug in the parser unit of my particular version of VIM (Which may be a bit old by now.)\n\nAny Assembly language isn't easy to hack.  Having a Syntax for it will not make you master it over night.  Having a syntax for a language you're familiar with will make your life much easier though.  \n\nAlso, expect a few other ASM syntaxes, as I may get to them (Perhaps PPC, Alpha, SH, MiPS, perhaps even a classic PDP11... ;-) \n\nSorry about being *REALLY* verbose.",
  "rating_total": "31",
  "rating_votes": "14",
  "downloads": "1293",
  "install_details": "Dunno for sure.  I hacked it up, in place in my /usr/share/vim/...... directory.  Place it somewhere where VIM will get it.  I think you need to hack your filetype.vim file to make it think that .asm, .S, .s, and such are assembly language files to use this syntax (asmx86.vim).  The \"default\" m68k line in there which comes pre-installed could just be changed to asmx86.vim.  Maybe a multiplexing system for this can be cooked up?",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=2942",
      "filename": "asmx86.vim",
      "script_version": "0.4",
      "date": "2004-04-16",
      "vim_version": "6.0",
      "author": {
        "user_id": "5002",
        "user_name": "lsdadam",
        "first_name": "Adam",
        "last_name": "Martin",
        "email": "adam at fsl.cs.sunysb.edu",
        "homepage": "http://nerdland.ath.cx:8081/"
      },
      "release_notes": "Initial upload"
    }
  ]
}
