{
  "script_id": "997",
  "display_name": "Window Sizes",
  "summary": "Allows multiple windows to have specific vertical sizes",
  "name": "Window-Sizes",
  "script_type": "utility",
  "description": "History:\n\n1.0:  Initial version\n\n1.1:  Added mapping <leader>tog to toggle the behavior of observing fixed\nwindow heights.  If disabled, vertically split windows can be used without a\nproblem.  Added two functions, WindowSizesEnabled and WindowSizesMaxEnabled,\nwhich return whether fixed sizes are observed and whether window maxing is\nenabled, respectively.\n\nPlugin to keep the vertical sizes of windows within specifications.  For\nexample, if you're using the Decho.vim plugin, you could force the DBG\nwindow to always be 10 lines high and for all other windows to automatically\nmaximize upon entry.  Or, you could specify explicit sizes for two windows\nand let all the remaining space be shared equally among the other windows.\n\nThis is a bit different from using equalalways and winheight=999 because it\nwill always honor the vertical height settings of individual windows, using\nthe maximizing or equalization only on those windows that don't have\nanything set explicitly.\n\nCaveat (and it's a big one):  No support for vertical splits.  If you have a\nvertical split, the behavior is undefined (well, it's not undefined, but\nit's ugly).\n\nUsage (default mappings):\n\n<leader>max:  Toggle whether windows without an explicit fixed size will\nautomatically maximize upon entry or whether all un-fixed-size windows will\nsimply share the vertical space left over once the fixed windows have taken\ntheir share of the space.\n\n<leader>fix:  If the current window has a preferred fixed vertical size,\nremove it, allowing this window to expand and contract according to the\ng:WindowSizes_windowMax setting.\n\n<leader>tog:  Toggle the fixed-window-size behavior; the <leader>max\nbehavior is controlled separately.  If fixed-window-sizes are not being\nobserved, then all windows are maximized blindly upon entering (without\nregard to their preferred height) if maximizing is enabled.\n\n<s-up>:  Increases the current windows's size by the value of the\nWindowSizes_increment variables (see below); using this mapping results in\nfixing the window height.\n\n<s-down>:  Decreases the current windows's size by the value of the\nWindowSizes_increment variables (see below); using this mapping results in\nfixing the window height.\n\nVariables (configuration):\ng:WindowSizes_windowMax:  If 1, then windows are maximized (the <leader>max\nmapping merely toggles this value between 1 and 0).\n\nb:preferredWindowSize:  If defined, the fixed vertical size of the current\nwindow -- the window will be this size vertically (tweaked by the\n<leader>fix, <s-up> and <s-down> mappings).  If not defined, a prompt is\ndisplayed for the user to specify a fixed vertical height for the current\nwindow where the current height is used as the default value (hit <ESC> to\nget out of it).\n\ng:WindowSizes_increment:  If defined, this is the increment by which to\nincrease or decrease the current window's size if using the <s-up> or\n<s-down> mappings.  If not defined, 5 is used.\n\nb:WindowSizes_increment:  If defined in a given window, this is the\nincrement by which to increase or decrease the current window's size when\nusing the <s-up> or <s-down> mappings.  If not defined, the global version\n(g:WindowSizes_increment) is used (if even THAT's not defined, 5 is used).\n\nFunctions (for use in the statusline, for example):\n\nWindowSizesEnabled:  Returns 1 if the preferred heights of windows is\ncurrently being observed (toggle with the <leader>tog mapping).\n\nWindowSizesMaxEnabled:  Returns 1 if the current window is going to get as\nmuch vertical real estate as possible (taking into consideration the\nWindowSizesEnabled setting and the presence of other windows).\n\nTips:\n\n- Always have at least one window without a specified size so it can take\n  over the remaining vertical space.\n\n- Always make sure that the total size of the fixed windows is less than the\n  actual number of lines visible on-screen!  (The behavior otherwise is\n  undefined -- that is, not tested by me.)\n\n- To restore a window to not having a preferred size, unlet\n  b:preferredWindowSize (just use the <leader>fix mapping).\n\nTODO:\n\n- Observe the 'laststatus' value.\n\n- Figure out how to change all the global variables to script or some such\n  so they don't pollute the global variable pool.\n",
  "rating_total": "4",
  "rating_votes": "1",
  "downloads": "500",
  "install_details": "Pop into your plugin directory; see the variables section for potential configuration (though none is explicitly required).",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=5301",
      "filename": "WindowSizes.vim",
      "script_version": "1.2",
      "date": "2006-02-22",
      "vim_version": "6.0",
      "author": {
        "user_id": "64",
        "user_name": "hemlock8",
        "first_name": "Salman",
        "last_name": "Halim",
        "email": "salmanhalim at hotmail.com",
        "homepage": ""
      },
      "release_notes": "Added the ability to toggle the behaviour on or off."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=3062",
      "filename": "WindowSizes.vim",
      "script_version": "1.1",
      "date": "2004-05-26",
      "vim_version": "6.0",
      "author": {
        "user_id": "64",
        "user_name": "hemlock8",
        "first_name": "Salman",
        "last_name": "Halim",
        "email": "salmanhalim at hotmail.com",
        "homepage": ""
      },
      "release_notes": "Added ability to disable the behavior where preferred heights are observed -- useful with vertically split windows (not perfect, but at least vertical splits are usable now).  Added two functions to return whether the main sizing behavior as well as the window maxing are enabled."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=3060",
      "filename": "WindowSizes.vim",
      "script_version": "1.0",
      "date": "2004-05-25",
      "vim_version": "6.0",
      "author": {
        "user_id": "64",
        "user_name": "hemlock8",
        "first_name": "Salman",
        "last_name": "Halim",
        "email": "salmanhalim at hotmail.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
