{
  "script_id": "1014",
  "display_name": "clipbrd",
  "summary": "Clipboard and other register content editor.",
  "name": "clipbrd",
  "script_type": "utility",
  "description": "Requires Vim 6.3\n\nSee vimtip#805 for an easy way to use the plugin as an external editor for most applications on windows.\n\nThis is a very simple utility that allows you to quickly view and edit contents (only those that are not read-only) of various registers that Vim supports. Most useful to quickly view and modify system clipboard using a shortcut (see Installation section). I often use this technique to even strip off the RTF to simple-text while copying from one application to other (that suppot RTF format, such as IE to Outlook).\n\n- Execute the default map (\\cb or <Leader>cb) or :ClipBrd command to view\n  the default register (\"*\", the clipboard register). You can also specify\n  the register name as an argument to the :ClipBrd command.\n- The register name is remembered (until you change it again by explicitly\n  specifying it) so that you don't have to specify it everytime you run\n  :ClipBrd command.\n- The \"[Clip Board]\" buffer is like a regular Vim file buffer, as you can\n  write (:w, :w!, :wq, :wq!), reload (:e, :e!) and quit (:q, :q!) the\n  buffer using the built-in Vim commands. Writing without the bang will\n  make the plugin prompt you for confirmation and where available, you can\n  click \"Cancel\" to prevent the buffer from quitting.\n- To refresh contents from the register, use :e or :e! command, or just\n  close and reopen the buffer. To quit without saving, just use the :q!\n  command.\n- Even other buffer commands and settings work as expected, e.g., you can\n  :hide the buffer if you can't decide to save or quit, and the contents\n  should remain the same when you come back, unless a different register\n  is explicitly specified while opening the clipboard. Setting 'bufhidden'\n  to \"hide\" or 'hidden' also should do the same.\n\n\nSearch_key_words: clipboard register genutils edit hari krishna dara",
  "rating_total": "43",
  "rating_votes": "15",
  "downloads": "1657",
  "install_details": "Requires Vim 6.3\n\n- Place the file in your plugin directory.\n- Also install the latest genutils.vim.\n- If you don't like the default map (\\cb), change it by placing the\n  following in your vimrc (change <Your Map> appropriately):\n    nmap <unique> <silent> <Your Map> <Plug>ClipBrdOpen\n- If you want to change the default register from \"*\" to something else,\n  put the following in your vimrc:\n    let g:clipbrdDefaultReg = '+' \n  The default register is significant only the first time you invoke the\n  ClipBrd without specifying any register.  \n- You can optionally create a program shortcut with the following as the\n  command:\n                                                                         \n    gvim +ClipBrd +only\n                                                                         \n  This allows you to use the shortcut to quickly view and edit the\n  system clipboard. I find it extremely useful. Place the shortcut in a\n  quick reach (like the windows taskbar) and you will have a powerful\n  clipboard editor handy all the time.\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=7201",
      "filename": "clipbrd.vim",
      "script_version": "2.0",
      "date": "2007-06-04",
      "vim_version": "7.0",
      "author": {
        "user_id": "292",
        "user_name": "haridsv",
        "first_name": "Hari Krishna",
        "last_name": "Dara",
        "email": "hari.vim at gmail.com",
        "homepage": ""
      },
      "release_notes": "- Updated to work with the latest version of genutils.vim\n- Bug fix: space in the plugin buffer name could cause issues.\n- Improved <C-G> in the plugin window to show some useful information.\n"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=3149",
      "filename": "clipbrd.vim",
      "script_version": "1.0",
      "date": "2004-06-18",
      "vim_version": "6.0",
      "author": {
        "user_id": "292",
        "user_name": "haridsv",
        "first_name": "Hari Krishna",
        "last_name": "Dara",
        "email": "hari.vim at gmail.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
