{
  "script_id": "1051",
  "display_name": "groff keymap",
  "summary": " groff latin1/cp1252/utf-8 keymap conversion file",
  "name": "groff-keymap",
  "script_type": "utility",
  "description": "This is a demonstration of the kind of abuse vim can handle and the\nmischief you can accomplish without delving into VimL \nprogramming. You don't need emacs to brew coffee....\n\nThis keymap works with groff and the default Western fonts\nsupplied with the PostScript output device. It should work with ATT ditroff\nas well because I used the old ATT syntax, but you may be in for a disappointing\nsurprise in such case: accented characters will be mostly faked.\n\nThis file covers codepage win-1252, because that's what I use in my\nworkstation. If you use some sort of Unix, your default codepage\nwill be ISO-8859-1, also known as Latin-1.  There are several\nobvious differences, all additions in the decimal codepoints 128-159\nare control codes in Latin-1.\n\nIf you need a different keymap, say for latin2 or cyrillic, you are\nwelcome to use these example files as a starting point. As well,\nI'll appreciate if you contribute them back to this package in order to\nhave a centralized distribution (you are welcome to take over\nownership, I don't look much at this package anymore!). I strongly\nrecommend that in such case, you use groff 1.19.1 or a later version\nbecause it can handle proper unicode decomposition.\n\nWhile testing these keymap files I discovered an intersting\nside-effect due to the way vim manages keymap files. Namely, that\nthe _active_ key mappings are those you can actually access with the\nkeyboard while in insert mode. If you can switch your keyboard\nmappings on-the-fly, as recent versions of Windows, can, you can\ntype several different Western Europe languages by switching\nkeyboard mappings at the OS level.\n\nFor example, in my keyboard with an Standard Spanish layout, there\nis no way to access directly an etsset «ß» using this keymap,\ntherefore the keymapping doesn't work. That is, I can type\n<ctr-k>ss but it won't expand to the troff request \\(ss --- \\[ss] in\nnative groff parlance --- but rather the 8-byte code «ß» as defined\nin the encoding; if I switch the keyboard driver to some German keybaord\ndriver (e.g., Swiss German) it will work though.\n",
  "rating_total": "1",
  "rating_votes": "1",
  "downloads": "253",
  "install_details": "Install files in $VIM/vimfiles/keymap for a global installation.\n\nFor a local installation use $HOME/.vim/keymap if using some UNIX/Linux, or $HOME/vimfiles/keymap if using windows.\n ",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=3298",
      "filename": "groff_keymap-1_0.tbz",
      "script_version": "1.0",
      "date": "2004-08-03",
      "vim_version": "6.0",
      "author": {
        "user_id": "5694",
        "user_name": "dradul",
        "first_name": "Pedro Alejandro",
        "last_name": "López-Valencia",
        "email": "vorbote at users.sourceforge.net",
        "homepage": "http://vorbote.wordpress.com/"
      },
      "release_notes": "Initial upload"
    }
  ]
}
