{
  "script_id": "1203",
  "display_name": "WhereFrom",
  "summary": "WhereFrom helps one locate where maps, functions, or commands are defined",
  "name": "WhereFrom",
  "script_type": "utility",
  "description": "The WhereFrom and WF commands search the runtimepath (see |'runtimepath'|) to determine where the setting, function, map, or command was defined.  With the \"!\", WhereFrom will continue looking for more than one instance.\n\n    WhereFrom[!] functionname(s)      WF[!] functionname(s)\n    WhereFrom[!] map(s)               WF[!] map(s)\n    WhereFrom[!] setting(s)           WF[!] setting(s)\n    WhereFrom[!] command(s)           WF[!] command(s)\n\n\nWF-style commands are available only if the command has not been previously defined, and are provided as a shorthand.\n\nA search is undertaken only for functions, commands, and maps, and then only if the function, command, or map is known to the currently running vim.  Determining where settings are set is done using vim's built-in method.\n\nThese commands don't search all *.vim files that you may have; it only examines those that lie on your runtimepath in the common directories plugin, ftplugin, colors, compilier, indent, syntax, and the after/ variants.  In addition, it also searches the AsNeeded directory (see vimscript#915)\n\n(alpha/beta version available at http://mysite.verizon.net/astronaut/vim/index.html#WHEREFROM)\n",
  "install_details": "* As usual with plugins: install it into your .vim/plugin (Windows: vimfiles\\plugin) directory.\n\n* gunzip WhereFrom.vim.gz\n\nThe next time you run vim, the embedded HelpExtractor (vimscript#748) will make the help for WhereFrom available (and remove itself from the WhereFrom script).",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=4188",
      "filename": "WhereFrom.vim.gz",
      "script_version": "2",
      "date": "2005-04-20",
      "vim_version": "6.0",
      "author": {
        "user_id": "96",
        "user_name": "cec",
        "first_name": "Charles",
        "last_name": "Campbell",
        "email": "drchip at campbellfamily.biz",
        "homepage": "http://mysite.verizon.net/astronaut/index.html"
      },
      "release_notes": "* Now includes $HOME/.vimrc on the list of files to be searched\n* GetLatestVimScripts auto-update enabled\n* Gives a message if unable to find a command/map/option\n"
    }
  ]
}
