{
  "script_id": "1208",
  "name": "vimCU",
  "summary": "comment/uncomment functionalities for every language",
  "script_type": "utility",
  "description": "vimCU is a set of ViM functions that you can use to customize your ViM editor to comment/uncomment source code of every language you like.\n\nComment key binding defaults to \",#\" while uncomment key binding to \",3\" (mnemonic: same key as comment, but without shift). In command mode the current line will be commented/uncommented, in visual mode all selected lines will.\n\nIn order to support commenting in the language of your choice you've to define how comments are handled in that language defining the following local variables:\n\n- variable \"b:CommentType\". A string formed using \"s\" and/or \"m\" chars; \"s\" means that your language supports single line comment like, e.g., bash script, perl or similar, that are comments formed adding something at the beginning and at the end of a line; \"m\" means that your language supports multi line comment like, e.g. ANSI C, OCaml, or similar, that are comments that extends from a character set to another character set; \"ms\" or \"sm\" mean that your language supports both kinds of comments like, e.g., C++.\n\n- variables: \"b:beginOfCommentSingle\", \"b:endOfCommentSingle\". Strings that are used to begin and end a single line comment. These strings are added at the begin and at the end of the line you want to commend.\n\n- variables: \"b:beginOfCommentMulti\", \"b:endOfCommentMulti\". Strings that are used to begin and end a multi line comment. These strings are added before and after the line(s) you are commenting on a line by themeselves.\n\nFor example, in order to support C++, just add to your ~/.vim/ftplugin/cpp.vim the following lines:\n      let b:CommentType = \"ms\"\n      let b:beginOfCommentSingle = \"// \"\n      let b:endOfCommentSingle = \"\"\n      let b:beginOfCommentMulti = \"/*\"\n      let b:endOfCommentMulti = \"*/\"\n",
  "install_details": "Just copy vimCU.vim somewhere (e.g. ~/.vim/vimCU.vim) and source it from your ~/.vimrc, e.g.:\n      source ~/.vim/vimCU.vim\n... and of course define the above variables for your favorite language! :-)",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=3881",
      "filename": "vimCU.vim",
      "script_version": "1.0",
      "date": "2005-02-19",
      "vim_version": "6.0",
      "author": {
        "user_id": "6957",
        "user_name": "zack",
        "first_name": "Stefano",
        "last_name": "Zacchiroli",
        "email": "zack at bononia.it",
        "homepage": "http://www.bononia.it/~zack/"
      },
      "release_notes": "Initial upload"
    }
  ]
}