{
  "script_id": "1301",
  "name": "Horses and sheep!",
  "summary": "All about horses and sheep",
  "script_type": "utility",
  "description": "This page used to point to an old script I hacked back in the day. Sadly it sucked and i wish i never made it. Unfortunately vim.org doesn't let you delete scripts... so rather than waste this space I have chosen to dedicate it to horses and sheep.\n\n==========================================\n\nHORSES\n\nFrom Wikipedia, the free encyclopedia\nThe horse (Equus caballus) is a hoofed (ungulate) mammal, one of eight living species of the family Equidae. The horse has evolved over the past 45 to 55 million years from a small multi-toed creature into the large, single-toed animal of today. Humans began to domesticate horses around 4500 BC, and their domestication is believed to have been widespread by 3000 BC; by 2000 BC the use of domesticated horses had spread throughout the Eurasian continent. Although most horses today are domesticated, there are still endangered populations of the Przewalski's Horse, the only remaining true wild horse, as well as more common feral horses which live in the wild but are descended from domesticated ancestors.\n\nThere is an extensive, specialized vocabulary used to describe equine-related concepts, covering everything from anatomy to life stages, size, colors, markings, breeds, locomotion, and behavior. Horses are anatomically designed to use speed to escape predators, and have a well-developed sense of balance and a strong fight-or-flight instinct. Related to this need to flee from predators in the wild is an unusual trait: horses are able to sleep both standing up and laying down. Female horses, called mares, carry their young for approximately 11 months, and a young horse, called a foal, can stand and run shortly following birth. Most domesticated horses begin training under saddle or in harness between the ages of two and four. They reach full adult development by age five, and have an average lifespan of between 25 and 30 years.\n\nHorse breeds are loosely divided into three categories based on general temperament: spirited \"hot bloods\" with speed and endurance; \"cold bloods,\" such as draft horses and some ponies, suitable for slow, heavy work; and \"warmbloods,\" developed from crosses between hot bloods and cold bloods, often focusing on creating breeds for specific riding purposes, particularly in Europe. There are over 300 breeds of horses in the world today, developed for many different uses.\n\nHorses and humans interact in many ways, not only in a wide variety of sport competitions and non-competitive recreational pursuits, but also in working activities including police work, agriculture, entertainment, assisted learning and therapy. Horses were historically used in warfare. A wide variety of riding and driving techniques have been developed, using many different styles of equipment and methods of control. Many products are derived from horses, including meat, milk, hide, hair, bone, and pharmaceuticals extracted from the urine of pregnant mares. Humans provide domesticated horses with food, water and shelter, as well as attention from specialists such as veterinarians and farriers.\n\n==========================================\n\nSHEEP\n\nFrom Wikipedia, the free encyclopedia\n\nDomestic sheep (Ovis aries) are quadrupedal, ruminant mammals typically kept as livestock. Like all ruminants, sheep are members of the order Artiodactyla, the even-toed ungulates. Although the name \"sheep\" applies to many species, in everyday usage it almost always refers to Ovis aries. Numbering a little over 1 billion, domestic sheep are the most numerous species in their genus.\n\nSheep are most likely descended from the wild mouflon of Europe and Asia. One of the earliest animals to be domesticated for agricultural purposes, sheep are raised for fleece, meat (lamb or mutton) and milk. A sheep's wool is the most widely used of any animal, and is usually harvested by shearing. Ovine meat is called lamb when from younger animals and mutton when from older ones. Sheep continue to be important for wool and meat today, and are also occasionally raised for pelts, as dairy animals, or as model organisms for science.\n\nSheep husbandry is practised throughout the majority of inhabited world, and has been fundamental to many civilizations. In the modern era, Australia, New Zealand, the southern and central South American nations, and the British Isles are most closely associated with sheep production. Sheep-raising has a large lexicon of unique terms which vary considerably by region and dialect. Use of the word sheep began in Middle English as a derivation of the Old English word sc&#275;ap; it is both the singular and plural name for the animal. A group of sheep is called a flock, herd or mob. Adult female sheep are referred to as ewes, intact males as rams or tups, castrated males as wethers, and younger sheep as lambs. Many other specific terms for the various life stages of sheep exist, generally related to lambing, shearing, and age.\n\nBeing a key animal in the history of farming, sheep have a deeply entrenched place in human culture, and find representation in much modern language and symbology. As livestock, sheep are most-often associated with pastoral, Arcadian imagery. Sheep figure in many mythologiessuch as the Golden Fleeceand major religions, especially the Abrahamic traditions. In both ancient and modern religious ritual, sheep are used as sacrificial animals. In contemporary English language usage, people who are timid, easily led, or stupid are \n\n",
  "install_details": "",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9832",
      "filename": "sheep.jpg",
      "script_version": "bahhhhh!",
      "date": "2009-01-15",
      "vim_version": "6.0",
      "author": {
        "user_id": "7006",
        "user_name": "scrooLoose",
        "first_name": "Marty",
        "last_name": "Grenfell",
        "email": "martin.grenfell at gmail.com",
        "homepage": "http://got-ravings.blogspot.com/"
      },
      "release_notes": "A sheep!"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9830",
      "filename": "horse.jpg",
      "script_version": "neiighh!",
      "date": "2009-01-15",
      "vim_version": "6.0",
      "author": {
        "user_id": "7006",
        "user_name": "scrooLoose",
        "first_name": "Marty",
        "last_name": "Grenfell",
        "email": "martin.grenfell at gmail.com",
        "homepage": "http://got-ravings.blogspot.com/"
      },
      "release_notes": "A horse!"
    }
  ]
}