{
  "script_id": "1304",
  "name": "php_funcinfo.vim",
  "summary": "Quick help on PHP functions",
  "script_type": "ftplugin",
  "description": "A filetype plugin file for PHP. Displays a list of built-in PHP functions, their prototypes and short descriptions.\n\nIntended to be quick-reference-under-hand while editing a PHP script. You hit a hotkey, it opens a list of all PHP functions and displays a short synopsis for the word under cursor, if that is found.\n\nThe plugin is =UNFINISHED=, so there are some bugs:\n- Some bugs in function list updating. Flicker. And somewhere in moving back-and-forth, wrong entries begin to show up.\n- Syntax highlighting of the function prototype is quite messy.\n- No mappings to put the selected function call back into the text.\n- Speedup might help.\n\nAlso planned:\n- Parse the XML source of the manual thoroughly, including predefined constants and variables, dividing functions into sections, etc.\n- Kind of integration with external help, like Vim format by Jörn Horstmann (http://planetxml.de/vim-php-manual.php), or HTML format (will probably have to write a Vim browser) or CHM.\n\nAnybody who cares, feel free to take over the development of this plugin.\n\nZIP file is 80 Kb.",
  "rating_total": "3",
  "rating_votes": "5",
  "downloads": "850",
  "install_details": "Put php_funcinfo.vim and php_funcinfo.txt (this is the list of functions, not docs) in\n~/.vim/after/ftplugin (Unix) or\n$VIM\\vimfiles\\after\\ftplugin (Windows)\n\nThe default mapping for the hotkey is <F2>, which interferes with the EasyHTML plugin, and EasyHTML is loaded by the default php ftplugin. That's why the script must go to the /after directory. I suppose that nobody needs EasyHTML while editing PHP code. Or you can change the mapping.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=4366",
      "filename": "php_funcinfo.zip",
      "script_version": "1.0",
      "date": "2005-06-15",
      "vim_version": "6.0",
      "author": {
        "user_id": "7775",
        "user_name": "kAtremer",
        "first_name": "kAtremer",
        "last_name": "",
        "email": "katremer at yandex.ru",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
