{
  "script_id": "1348",
  "name": "The Vim Gardener",
  "summary": "Dark and colorful forrest khaki theme works with 256 color xterms",
  "script_type": "color scheme",
  "description": "  'For code surgeons and web gardeners everywhere'\n\nA nice earthy  color scheme which is easy on  the eyes. It\nhas  as it's  base a  dark background  monocrhomatic khaki\nscheme with dabs of color thrown  in here and there on the\nkeywords. It's gives you the feeling of looking at the sun through \nthe afternoon spring leaves, but all at night time :)\n\nPlus  lots of  extra config  options so  you can\ntweak  it to  your liking  and or  make it  more like  the\noriginal Guardian scheme. All the defaults are what I like\nbut if you want to change stuff just set the right var and\nit will change pretty much  immediately, you might have to\nmove out of and back into your buffer for it to refresh.\n\n\nNew Features:\n  256 Color XTerm Compatibility\n  Richer Syntax\n  Black Background\n  Functions\n  No Italics\n  Purple Booleans\n  Swapped Status Line Colors\n  Green like a garden\n  Other minor tweaks\n\nScreenshot:\n  http://entheon.com/vim-gardener.gif\n",
  "rating_total": "17",
  "rating_votes": "8",
  "downloads": "3069",
  "install_details": "put the gardener.vim file into your ~/.vim/colors/ dir then from within vim do\n:colorscheme gardener\n\nif you're in the terminal and the colorscheme command doesn't work or it turns your file into black and white, then from within vim you'll need to do\n:set t_Co=256\n\nyou'll probably want to put that in your ~/.vimrc\n\nyou also need 256 color support compiled into your terminal, I've tested this with both xterm and rxvt, they both work fine with default settings as long as you do :set t_Co=256 and as long as the terminal was compiled with the --enable-256-color option",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=4682",
      "filename": "gardener.vim",
      "script_version": "1.1",
      "date": "2005-10-18",
      "vim_version": "6.0",
      "author": {
        "user_id": "8321",
        "user_name": "entheon",
        "first_name": "Maestro",
        "last_name": "Entheon",
        "email": "jazzworksweb at yahoo.com",
        "homepage": ""
      },
      "release_notes": "this is what i've been using for the past few months and I've probably put some tweaks on it though i can't remember all of what exactly - eventually i'm going to make the gui colors identical to the terminal colors because i think the terminal actually looks better than the gui atm - that'll be version 1.2 when i do that"
    }
  ]
}