{
  "script_id": "1356",
  "display_name": "eraseSubword",
  "summary": "Erase one subword from a camel case word or from a _ delimited word",
  "name": "eraseSubword",
  "script_type": "utility",
  "description": "Makes <C-H> in insert mode delete one subword from a camel case word or one _ delimited subword before the cursor.\n\nFor example, the following word is typed in an editor:\n\none_twoThree\n\nFirst <C-H> will delete \"Three\", second - \"two\" and the third will completely erase the word.\n\nDefault mapping could be changed by setting g:EraseSubword_insertMap to the desired key.  Setting s:EraseSubword_insertMap to an empty string would remove default mapping at all.  Mapping could be changed later (for example in file type plugin or in some auto commands) using EraseSubword_setInsertMap function that takes one argument - new value for the g:EraseSubword_insertMap.  Empty value would disable plugin and any other value would add new mapping (old mapping would be removed).\n\nThere is also a possibility to use buffer local mapping.  Than you probably want to set g:EraseSubword_insertMap to an empty string (so that there would be no global mapping) and then use EraseSubword_setlocalInsertMap in FileType auto command or BufNew, BufCreate and a like to set buffer local mapping.  EraseSubword_setlocalInsertMap uses same syntax as EraseSubword_insertMap - one argument that is a desired mapping or empty string to remove existing mapping.",
  "install_details": "Copy eraseSubword.vim to your ~/vimfiles/plugin directory.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=4606",
      "filename": "eraseSubword.vim",
      "script_version": "4",
      "date": "2005-09-21",
      "vim_version": "6.0",
      "author": {
        "user_id": "7920",
        "user_name": "liya",
        "first_name": "Ilya",
        "last_name": "Bobir",
        "email": "ilya at po4ta.com",
        "homepage": ""
      },
      "release_notes": "+ Mapping can be changes and buffer local mapping can be set\n* 'ignorecase' was not properly handled\n* Sometimes deleted to mutch"
    }
  ]
}
