{
  "script_id": "1384",
  "display_name": "UniCycle",
  "summary": "Unicode character cycler",
  "name": "UniCycle",
  "script_type": "utility",
  "description": "This script cycles through certain Unicode characters while typing. It only\nworks if set encoding=utf-8.\n\nWhen on, the hyphen (-), period (.), apostrophe ('), and quote (\")\ncharacters are mapped to the appropriate functions within this file.\n\nWhen you enter two hyphen characters in a row, the first hyphen character\nwill cycle to an EN DASH character. A third hyphen will turn the EN DASH\ninto an EM DASH. A fourth hyphen will turn your EM DASH back into a\nHYPHEN-MINUS.\n\nEntering three periods in a row will replace all three periods with a\nHORIZONTAL ELLIPSIS character.\n\nEntering an apostrophe will try to determine if the apostrophe should be a\nLEFT SINGLE QUOTATION MARK or RIGHT SINGLE QUOTATION MARK. It does this by\nlooking at the character to the left of the new character. You can cycle\nbetween LEFT SINGLE QUOTATION MARK, APOSTROPHE, and RIGHT SINGLE QUOTATION\nMARK by repeatedly hitting your apostrophe key.\n\nQuote characters are treated in the same manner as apostrophe characters.\nYou get either a LEFT DOUBLE QUOTATION MARK, normal QUOTATION MARK, or RIGHT\nDOUBLE QUOTATION MARK based on the previous character and how many times you\nhit your quote key in a row.",
  "rating_total": "60",
  "rating_votes": "21",
  "downloads": "1134",
  "install_details": "To install, drop it in your plugins directory. To use, execute the\n:UniCycleOn command. Turn turn it off, execute :UniCycleOff.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=4689",
      "filename": "unicycle.vim",
      "script_version": "1",
      "date": "2005-10-20",
      "vim_version": "6.0",
      "author": {
        "user_id": "8629",
        "user_name": "jdiamond",
        "first_name": "Jason",
        "last_name": "Diamond",
        "email": "jason at diamond.name",
        "homepage": "http://jason.diamond.name/"
      },
      "release_notes": "Initial upload"
    }
  ]
}
