{
  "script_id": "1420",
  "name": "openvpn",
  "summary": "OpenVPN configuration syntax highlighter",
  "script_type": "syntax",
  "description": "This vim syntax script highlights configuration files used with James\nYonan's OpenVPN application (http://openvpn.net).\n\nFeatures:\n\n  * Highlights options, comment lines, and arguments\n  * Recognizes quoted strings and escaped characters (e.g. \\\\, \\\")\n  * Flags arguments given for options that take no arguments\n  * Special highlighting for route and server command arguments\n\nReporting Issues:\n\n  If you discover an OpenVPN file that this script highlights incorrectly,\n  please email the author (address at the top of the file) with the\n  following information:\n\n    * Problem OpenVPN file WITH ANY SENSITIVE INFORMATION REMOVED\n    * The release version of this script (see top of the file)\n    * If possible, a patch to fix the problem\n\nDesign Notes:\n\n  Part of this script is autogenerated from the output of openvpn --help.\n  The source code for generating the script is available from the author on\n  request (see email address at the top of the script).  The script should\n  build from source on most Linux systems with openvpn installed.\n\n  The build system that generates this script strips special CVS tokens\n  (like \"Id:\") so that CVS no longer recognizes them.  This allows users to\n  place this script in their own version control system without losing\n  information.  The author encourages other vim script developers to adopt a\n  similar approach in their own scripts.\n",
  "rating_total": "5",
  "rating_votes": "4",
  "downloads": "533",
  "install_details": "  Put this file in your user runtime syntax directory, usually ~/.vim/syntax\n  in *NIX or C:\\Program Files\\vim\\vimfiles\\syntax in Windows.  (Type \"h\n  syn-files\" from within vim for more information.)\n\n  Setting up automatic filetype definition requires some knowledge about\n  your system.  The OpenVPN application itself does not require a naming\n  standard for configuration files, although most distribution packages use\n  a .conf suffix.  However, the .conf suffix is also used by many other\n  applications with different syntaxes, so one cannot determine filetype by\n  filename alone.\n\n  One way to overcome this ambiguity is to incorporate the directory name\n  into the recognition process.  For example, adding the following lines to\n  the filetype.vim file in the user runtime directory should work for many\n  *NIX systems:\n     \n      au BufNewFile,BufRead *openvpn*/*.conf setfiletype openvpn |\n                                          \\  set commentstring=#%s\n\n  On the Fedora Core Linux distribution, this technique recognizes\n  configuration files in /etc/openvpn and\n  /usr/share/doc/openvpn-X.X.X/sample-config-files.  Setting the\n  commentstring option in the second line allows Meikel Brandmeyer's\n  EnhancedCommentify script (vimscript #23) to work with openvpn files.\n  (Advanced users may want to set the commentstring option in an ftplugin\n  file or in autocommands defined in .vimrc.)\n     \n  If filename- and directory-based recognition is impractical, the easiest\n  alternative is to embed the following modeline in your OpenVPN\n  configuration files:\n\n      # vim:ft=openvpn:\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12713",
      "filename": "openvpn.tar.bz2",
      "script_version": "1.10",
      "date": "2010-03-27",
      "vim_version": "7.0",
      "author": {
        "user_id": "8940",
        "user_name": "ehaar",
        "first_name": "Eric",
        "last_name": "Haarbauer",
        "email": "ehaar70 at gmail.com",
        "homepage": ""
      },
      "release_notes": "Upgraded to openvpn 2.1.1."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=8938",
      "filename": "openvpn.tar.bz2",
      "script_version": "1.09",
      "date": "2008-07-12",
      "vim_version": "7.0",
      "author": {
        "user_id": "8940",
        "user_name": "ehaar",
        "first_name": "Eric",
        "last_name": "Haarbauer",
        "email": "ehaar70 at gmail.com",
        "homepage": ""
      },
      "release_notes": "Fixed incorrect highlighting thanks to tip from Endre Szabo.  Updated to OpenVPN 2.1 rc8."
    }
  ]
}