{
  "script_id": "1425",
  "name": "iptables",
  "summary": "iptables-save/restore syntax highlighter",
  "script_type": "syntax",
  "description": "This vim syntax script highlights files used by Harald Welte's iptables-save\nand iptables-restore utilities.  Both utilities are part of the iptables\napplication (http://www.netfilter.org/projects/iptables).\n\nFeatures:\n\n  * Distinguishes commands, options, modules, targets and chains.\n  * Distinguishes numeric IP addresses from net masks.\n  * Highlights tokens that occur only in hand-edited files; for example,\n    \"--append\" and \"destination-unreachable\".\n  * Special handling for module names; for example, the tcp module is\n    colored differently from the tcp protocol.\n\nOptions:\n\n  Customize the behavior of this script by setting values for the following\n  options in your .vimrc file.  (Type \":h vimrc\" in vim for more information\n  on the .vimrc file.)\n\n  g:Iptables_SpecialDelimiters\n    This variable, if set to a non-zero value, distinguishes numeric\n    delimiters, including the dots in IP addresses, the slash that separates\n    an IP address from a netmask, and the colon that separates the ends of a\n    port range.  If not set, this option defaults to off.\n\nKnown Issues:\n\n  * Some special argument tokens are highlighted whether or not they are\n    used with the correct option.  For example, \"destination-unreachable\"\n    gets special highlighting whether or not is used as an argument to the\n    --icmp-type option.  In practice, this is rarely a problem.\n\nReporting Issues:\n\n  If you discover an iptables file that this script highlights incorrectly,\n  please email the author (address at the top of the script) with the\n  following information:\n\n    * Problem iptables file WITH ANY SENSITIVE INFORMATION REMOVED\n    * The release version of this script (see top of the script)\n    * If possible, a patch to fix the problem\n\nDesign Notes:\n\n  Part of this script is autogenerated from the output of the iptables man\n  page.  The source code for generating the script is available from the\n  author on request (see email address at the top of the script).  The\n  script should build from source on most Linux systems with iptables\n  installed.\n\n  The build system that generates this script strips special CVS tokens\n  (like \"Id:\") so that CVS no longer recognizes them.  This allows users to\n  place the script in their own version control system without losing\n  information.  The author encourages other vim script developers to adopt a\n  similar approach in their own scripts.\n",
  "rating_total": "24",
  "rating_votes": "9",
  "downloads": "783",
  "install_details": "  Put this file in your user runtime syntax directory, usually ~/.vim/syntax\n  in *NIX or C:\\Program Files\\vim\\vimfiles\\syntax in Windows.  Type \":h\n  syn-files\" from within vim for more information.\n\n  The iptables-save and iptables-restore applications do not specify a\n  naming standard for the files they use.  However, iptables-save places a\n  comment in the first line of its output.  Other applications, such as\n  Fedora Core's system-config-securitylevel use the iptables-save/restore\n  format, but with a different leading comment.  We can use these leading\n  comments to identify the filetype by placing the following code in the\n  scripts.vim file in your user runtime directory:\n  \n     if getline(1) =~ \"^# Generated by iptables-save\" ||\n      \\ getline(1) =~ \"^# Firewall configuration written by\"\n         setfiletype iptables\n         set commentstring=#%s\n         finish\n     endif\n\n  Setting the commentstring on line 4 allows Meikel Brandmeyer's\n  EnhancedCommentify script (vimscript #23) to work with iptables files.\n  (Advanced users may want to set the commentstring option in an ftplugin\n  file or in autocommands defined in .vimrc.)\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12712",
      "filename": "iptables.tar.bz2",
      "script_version": "1.07",
      "date": "2010-03-27",
      "vim_version": "6.0",
      "author": {
        "user_id": "8940",
        "user_name": "ehaar",
        "first_name": "Eric",
        "last_name": "Haarbauer",
        "email": "ehaar70 at gmail.com",
        "homepage": ""
      },
      "release_notes": "Updated for iptables 1.4.5."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=8939",
      "filename": "iptables.tar.bz2",
      "script_version": "1.06",
      "date": "2008-07-12",
      "vim_version": "7.0",
      "author": {
        "user_id": "8940",
        "user_name": "ehaar",
        "first_name": "Eric",
        "last_name": "Haarbauer",
        "email": "ehaar70 at gmail.com",
        "homepage": ""
      },
      "release_notes": "Fixed highlighting problem thanks to tip from Endre Szabo.  Updated keywords to iptables 1.4.1.1."
    }
  ]
}
