{
  "script_id": "1464",
  "name": "moria",
  "summary": "A color scheme for GUI supposed to be highly readable",
  "script_type": "color scheme",
  "description": "This color scheme contains four color schemes: two dark and two light color schemes. All highlighting groups have similar brightness. In the dark schemes bold highlighting is avoided, but used where it is reasonable. Different highlighting groups can be distinguished easily without a cluttered appearance. The highlights of all four color schemes have similar colors, but differ in contrast. \n\nThis color scheme is for the GUI version of Vim and makes only some minor tweaks for the console version.\n\nThis color scheme is optimized for Vim 7.0, but works for Vim 6.0, too.",
  "install_details": "Just put it in \"~/.vim/colors\" or in \"<your vim directory>\\vimfiles\\colors\" on Windows. Do \":colo moria\" to apply it. If you want to install it as your default color scheme, just add \"colo moria\" to your vimrc file.\n\nThe color scheme choses the color scheme 'dark' if 'background' is set to dark and 'light' if 'background' is set to light. One can override this by setting the variable 'moria_style'. Its possible values are 'black', 'dark', 'light', and 'white'. The 'dark' scheme has #202020 as its background, the 'light' scheme #f0f0f0, the 'black' ('white') scheme has a black (white) background. If you want to use the 'white' scheme, just do\n\nlet moria_style = 'white'\ncolo moria\n\nin your vimrc file. Alternatively, you can set the option 'background' instead of 'moria_style' to 'dark' or 'light' and the color scheme applies either the 'dark' scheme or the 'light' one.\n\nIn gVim you can do 'Colo black', 'Colo dark', 'Colo light', and 'Colo white' to swith to the color scheme you want. In Vim (console version) these commands just swith between a dark and a light scheme.\n\nThe default colors of StatusLine, Pmenu, LineNr, ... is blue. If you like monochrome colors for these highlighting groups, there is the option 'moria_monochrome'. If the default colors do not fit to the color scheme of your desktop environment, monochrome colors will probably match better. Someone may find monochrome colors of these highlighting groups more pleasant to the eyes, too. To aktivate this option just add\n\nlet moria_monochrome = 1\n\nto your vimrc file (before 'colo moria', of course).\n\nIn the dark schemes ('black' and 'dark') bold highlights are avoided. However, some people like the highlights 'Statement', 'Type' and some other highlights to be bold. If you belong to these people, just add\n\nlet moria_fontface = 'mixed'\n\nto your vimrc file.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=13617",
      "filename": "moria.vim",
      "script_version": "2.6.4",
      "date": "2010-08-18",
      "vim_version": "7.0",
      "author": {
        "user_id": "6642",
        "user_name": "GDahn",
        "first_name": "Georg",
        "last_name": "Dahn",
        "email": "gorgyd at yahoo.co.uk",
        "homepage": ""
      },
      "release_notes": "Changed names of colors to numbers for ctermbg and ctermfg, because names did not work on my Mac. Highlight information for ColorColumn."
    }
  ]
}