{
  "script_id": "1535",
  "display_name": "TagsParser",
  "summary": "Automatic tagfile updating and tag viewer",
  "name": "TagsParser",
  "script_type": "utility",
  "description": "\nThe TagsParser plugin does two things.\n\nFirst it automatically updates the tag files when you write a file out (Dynamic Tags).  This is controlled by a path so that this does not happen for every file that you ever edit.  This way as soon as you save a file, you will be able to access tags via the usual vim methods ^], :tag, :ts, ^T, etc.  There are various options in the plugin that control which files to tag.  \n\nThis is nice if you have a bunch of source that you are working on, and like to use ctags to navigate through your source, but get annoyed at manually re-tagging your source to pick up any new variables/functions/etc.\n\nSecondly, there is a tag viewer (the Tag Window) which uses the tag files created by the Dynamic Tag functionality of the script to display the tags that belong to the file you have open.  For C/C++ and Ada files, it will display the tags hierarchically, so for example, struct members get displayed below the struct they belong to.  This part of the script can be turned off if you prefer to only use the Dynamic Tags functionality.  There are many options which control what is displayed and how, and of course, these are all detailed in the included help file.\n\nConfiguring the \"TagsParserTagsPath\" or \"TagsParserProjectConfig\" options can be difficult sometimes.  The \":TagsParserPrintPath\" command can help you debug the normal tags path variable, but has not been updated to support debugging the project configurations yet.  See the \"tagsparser-config\" help file entry for more details, but this is the short version:\n\nThe first important thing to keep in mind, is to use either unix-style slashes (/), or to 'escape' your windows-style slashes when using a double quoted path (\"stuff\\\\foo\").  Alternatively single quotes can be used instead ('stuff\\foo').\n\nThe second important thing to keep in mind is that the directories used in defining the project configuration root directories must be defined using the correct slash style for your platform.  So for example, MS windows users _must_ use \"\\\" instead of \"/\".  Following is an project configuration setup:\n\n  let g:TagsParserProjectConfig = {}\n  let g:TagsParserProjectConfig['C:\\Working\\PRJ1\\Software\\Source Code'] = {}\n  let g:TagsParserProjectConfig['C:\\Working\\PRJ1\\Software\\Source Code'] = { 'tagsPath' : 'C:/Working/PRJ1/Software/Source Code/OBJ1,C:/Working/PRJ1/Software/Source Code/OBJ1/**,C:/Working/PRJ1/Software/Source Code/BSP,C:/Working/PRJ1/Software/Source Code/BSP/**' }\n  let g:TagsParserProjectConfig['C:\\Working\\PRJ2\\Software\\OBJ1'] = {}\n  let g:TagsParserProjectConfig['C:\\Working\\PRJ2\\Software\\OBJ1'] = { 'tagsPath' : 'C:/Working/PRJ2/Software/OBJ1,C:/Working/PRJ2/Software/OBJ1/**' }\n\nThis plugin supports all filetypes that Exuberant Ctags supports, along with Ada.  For Ada support I have created an Ada Mode parser for Ctags.  You can find the latest version of that parser here: http://gnuada.svn.sourceforge.net/viewvc/gnuada/tags/ At the time that I am writing this version 4.1.0 was the latest and is in this directory: http://gnuada.svn.sourceforge.net/viewvc/gnuada/tags/ctags-ada-mode-4.1.0 Directions to install the ada.c file are in the file itself, or you can use the add_ada.vim file to do the necessary updates to the ctags source for you.\n\nThere are many options that govern how the Tag Window appears, I have tried to setup the default options so that it will display nicely with out any customization, but if you so desire there should be many ways to adjust the way the window appears.\n\nPlease email me with any questions you have or bugs you find.  I am also happy to take suggestions for features or options that would make this plugin more useful for you.\n\n-------- Notable Additions -------\n- Example configuration options in help file.\n\n- Tabpage support that actually works!  (I hope)...\n\n- Debugging functionality.\n\n- TagsParserCurrentFileCWD feature (added in an earlier release, but was missing from documentation.\n\n--- Previous Notable Additions ---\n- The big addition to version 0.9 is project configurations, these are only supported in Vim 7.0.  The full details can be gathered if you check the help page for \"TagsParserProjectConfig\", but a short version is here:\nInstead of one path variable (\"TagsParserTagsPath\"), now you can configure separate paths for different 'projects'.  A project is configured using a Vim hash (dictionary), where the root directory of a project is used as the hash key.  Then a TagsPath, TagsLib, and various other variables can be configured uniquely for every project.  This should reduce the time required to find tags in each project.\n\n- Tabpages are now supported when using the Tag Window functionality.  Also added some mappings to make it easier to navigate between tabs and buffers.  See \"TagsParserCtrlTabUsage\" for detailed information.\n\n- All commands have default key mappings (such as <leader>t<space> to toggle the Tag Window On and Off - :TagsParserToggle), and these can all be overridden by a user mapping.\n\n- The TagsParserSaveInterval variable now prevents tagging a file too frequently (default of 30 second wait period).\n\n- The TagsParserTagsDir variable can now be used to change the name of the directory that is created to store tag files in (default of \".tags\").\n\n- The TagsParser functions are now autoloaded, hopefully this speeds up vim startup and reduces overhead when the TagsParser is not being used.\n\n- See \"tagsparser-changelog\" for more detailed information. ",
  "rating_total": "111",
  "rating_votes": "33",
  "downloads": "1641",
  "install_details": "This script requires a few supporting things to be installed.  Exuberant Ctags (http://ctags.sourceforge.net/) and if you are not using Vim 7.0, or just like it better, Perl (http://www.perl.com/).\n\nFor most linux/unix people these won't be a problem.  If you are running windows and need Perl, you will need to install perl (http://www.activestate.com/Products/ActivePerl/ is a decent version), and ctags.  And for those running MacOS X you will likely only need to install ctags, because the ctags that comes with MacOS X by default is not Exubernat Ctags.\n\nUntar the tarball in a directory in your vim runtimepath.  Usually ~/.vim, $VIM/vimfiles, something along those lines.  There are 3 files: autoload/TagsPaser.vim, plugin/TagsPaser.vim and doc/TagsParser.txt.  After these files have been extracted, run the following command in Vim \":helptags <path>/doc\" to index the new TagsParser help file.\n\nTagsParser is no longer packaged in a vimball because the TagsParser plugin does not require Vim 7.0, but the vimball plugin does.  I like the concept of a vimball because it makes installation easier, but I need to make sure that the plugin distribution method supports the same number of users that the plugin supports.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6835",
      "filename": "TagsParser-0.9.1.tar.gz",
      "script_version": "0.9.1",
      "date": "2007-03-04",
      "vim_version": "6.0",
      "author": {
        "user_id": "10000",
        "user_name": "sprout",
        "first_name": "Aaron",
        "last_name": "Cornelius",
        "email": "A.Aaron.Cornelius at gmail.com",
        "homepage": ""
      },
      "release_notes": "Addition of configuration examples.\nBig fixes for tabpage/multiple file editing (sorry it was so busted in 0.9).\nAddition of debugging functionality."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6739",
      "filename": "TagsParser-0.9.tar.gz",
      "script_version": "0.9",
      "date": "2007-02-13",
      "vim_version": "6.0",
      "author": {
        "user_id": "10000",
        "user_name": "sprout",
        "first_name": "Aaron",
        "last_name": "Cornelius",
        "email": "A.Aaron.Cornelius at gmail.com",
        "homepage": ""
      },
      "release_notes": "Addition of some new features, most notably project configurations and tabpage support (these require Vim 7.0 to use though).  Many bugfixes also implemented.\n"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6394",
      "filename": "TagsParser-0.7.tar.gz",
      "script_version": "0.7",
      "date": "2006-11-08",
      "vim_version": "6.0",
      "author": {
        "user_id": "10000",
        "user_name": "sprout",
        "first_name": "Aaron",
        "last_name": "Cornelius",
        "email": "A.Aaron.Cornelius at gmail.com",
        "homepage": ""
      },
      "release_notes": "Many updates and bugfixes... Addition of fully Vim native functions, Perl is no longer required for users of Vim 7.0 and greater."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6228",
      "filename": "TagsParser-0.5.vba.gz",
      "script_version": "0.5",
      "date": "2006-09-25",
      "vim_version": "7.0",
      "author": {
        "user_id": "10000",
        "user_name": "sprout",
        "first_name": "Aaron",
        "last_name": "Cornelius",
        "email": "A.Aaron.Cornelius at gmail.com",
        "homepage": ""
      },
      "release_notes": "Vimball of version 0.5"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6227",
      "filename": "TagsParser-0.5.tar.gz",
      "script_version": "0.5",
      "date": "2006-09-25",
      "vim_version": "6.0",
      "author": {
        "user_id": "10000",
        "user_name": "sprout",
        "first_name": "Aaron",
        "last_name": "Cornelius",
        "email": "A.Aaron.Cornelius at gmail.com",
        "homepage": ""
      },
      "release_notes": "Another bugfix release.  The complete changes are in the change log.  It has been a while since I uploaded some fixes so I thought it was time."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=5824",
      "filename": "TagsParser-0.4.vba",
      "script_version": "0.4",
      "date": "2006-06-11",
      "vim_version": "7.0",
      "author": {
        "user_id": "10000",
        "user_name": "sprout",
        "first_name": "Aaron",
        "last_name": "Cornelius",
        "email": "A.Aaron.Cornelius at gmail.com",
        "homepage": ""
      },
      "release_notes": "Some bugfixes and modifications.\nThis is the vimball of version 0.4 (instead of a tarball).  You must have the vimball script installed (http://www.vim.org/scripts/script.php?script_id=1502), which it is by default on vim 7."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=5823",
      "filename": "TagsParser-0.4.tar.gz",
      "script_version": "0.4",
      "date": "2006-06-11",
      "vim_version": "6.0",
      "author": {
        "user_id": "10000",
        "user_name": "sprout",
        "first_name": "Aaron",
        "last_name": "Cornelius",
        "email": "A.Aaron.Cornelius at gmail.com",
        "homepage": ""
      },
      "release_notes": "Some bugfixes and modifications."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=5652",
      "filename": "TagsParser-0.3.tar.gz",
      "script_version": "0.3",
      "date": "2006-05-07",
      "vim_version": "6.0",
      "author": {
        "user_id": "10000",
        "user_name": "sprout",
        "first_name": "Aaron",
        "last_name": "Cornelius",
        "email": "A.Aaron.Cornelius at gmail.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
