{
  "script_id": "1633",
  "name": "svncommand-tng",
  "summary": "Subversion (svn) Integration Plugin, the next generation (tng)",
  "script_type": "utility",
  "description": "This is an update to Adam Lazur's svncommand script, vimscript #922, which was itself based on the cvscommand script (now vcscommand), vimscript #90.\n\nKeywords: svn SVN svncommand subversion Subversion\n\nBasically I pulled a newer version of cvscommand (1.76) that had a lot of nice updates that I wanted to use with Subversion and did what Adam did, which is lots of 's/CVS/SVN/'.  Then hacked on it till it worked like it was supposed to.  I also pulled in Adams SVNCommitDiff function for displaying a diff for a svn-commit.* file.  \n\nFinally, I added a few features of my very own:\n - Option to enable automatic execution of SVNCommitDiff when a svn-commit.* file is loaded.\n - A simple property editor.  SVNPropedit with no options runs \"svn proplist\" to give you a listing of all the set properties.  If given an argument, it grabs the property of that name and gives you a window to update the value in.\n \nThe vcscommand script has just been updated to support Subversion (8-10-06), but so far there is not a property editor or CommitDiff function.\n\nShoot me an email if you find my additions useful! ",
  "rating_total": "26",
  "rating_votes": "11",
  "downloads": "1148",
  "install_details": "Untar the file into a temporary directory (Assuming Linux):\n   # cd /tmp\n   # tar -zxvf /downloads/svncommand-{REL}.tar.gz\n\nThen you can install the files in one of two ways:\n\n  - Allow my Makefile to install everything in the right subdirectory under ~/.vim\n    # cd svncommand-{REL}\n    #  make install             \n - Manually copy each file in the subdirectories of the release to the same named directory under ~/.vim\n\nThis might well work with VIM 6.0 (cvscommand 1.76 does and it was based on that) but I have only tested it on 7.0 under Linux.  ",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6058",
      "filename": "svncommand-1.76.2.tar.gz",
      "script_version": "1.76.2",
      "date": "2006-08-10",
      "vim_version": "7.0",
      "author": {
        "user_id": "10452",
        "user_name": "troycurtisjr",
        "first_name": "Troy",
        "last_name": "Curtis",
        "email": "troycurtisjr at gmail.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}