{
  "script_id": "1689",
  "display_name": "mail_indenter",
  "summary": "pretty indentation for e-mail replying",
  "name": "mail_indenter",
  "script_type": "utility",
  "description": "This tiny script (my first one) can convert this:\n\nOn 2006/10/23@16:47, <Mauro, Sauco> wrote:\n  > This is a post with a very long text without wrapping of text that can go on and on forever and its very annoying because it will make the reply almost impossible to understand.\n  > This is another very long line that looks very ugly because some e-mail clients will wrap it automatically but will not consider the indentation mark.\n  > I love inline replaying because:   \n  > 1. Inline posting creates a natural, chronological ordering to each segment of the discussion stored within a message.\n  > 2. Inline posting promotes the practice of trimming quoted text to prevent signature blocks, free-mail-service ads, and corporate disclaimers piling up in a growing useless \"tail\" at the end.\n  > 3. nline posting doesn't require the poster to recap each issue being addressed, as comments can be made point-for-point against the original message, making for a more structured, disciplined and unambiguous reply.\n\nInto this:\n\nOn 2006/10/23@16:47, <Mauro, Sauco> wrote:\n  Mauro> This is a post with a very long text without wrapping of text   \n  Mauro> that can go on and on forever and its very annoying because it\n  Mauro> will make the replay almost impossible to understand.  This is\n\nThen you can replay inline like this.\n   \n  Mauro> another very long line that looks very ugly because some e-mail   \n  Mauro> clients will wrap it automatically but will not consider the\n  Mauro> indentation mark.  I love inline replaying because: 1. Inline\n\nOr like this.\n\n  Mauro> posting creates a natural, chronological ordering to each   \n  Mauro> segment of the discussion stored within a message.  2. Inline\n  Mauro> posting promotes the practice of trimming quoted text to   \n  Mauro> prevent signature blocks, free-mail-service ads, and corporate\n  Mauro> disclaimers piling up in a growing useless \"tail\" at the end.\n\nI agree !\n\n  Mauro> 3. nline posting doesn't require the poster to recap each issue\n  Mauro> being addressed, as comments can be made point-for-point\n  Mauro> against the original message, making for a more structured,\n  Mauro> disciplined and unambiguous reply.\n\nIn case you didn't notice, the text is now wrapped at 72 and indented with the recipients name.\nHow you like it ?\n\nPlese feel free to drop me an e-mail with questions, suggestions, etc.\n\nRead the header of the script for keybidings.",
  "rating_total": "25",
  "rating_votes": "7",
  "downloads": "311",
  "install_details": "You can source it  like this:\n      vim -c 'source mail_indenter.vim'\nOr within Vim like this:\n     :source mail_indenter.vim\nIn .muttrc like this:\n    set editor=\"vim -f +8 -c 'source  mail_indenter.vim' \"\nOr copy it to ~/.vim/plugin/\n\n     ",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6327",
      "filename": "mail_indenter.vim",
      "script_version": "0.1",
      "date": "2006-10-23",
      "vim_version": "6.0",
      "author": {
        "user_id": "11067",
        "user_name": "mauro",
        "first_name": "Mauro",
        "last_name": "Sauco",
        "email": "mauro at sauco.net",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
