{
  "script_id": "1720",
  "display_name": "gvimext.dll: support tabs under VIM 7",
  "summary": "Support loading files into a VIM tab",
  "name": "gvimext.dll--support-tabs-under-VIM-7",
  "script_type": "utility",
  "description": "Important: this update only applies to VIM 7.\n\nThis update to gvimext.dll supports the loading of files under a new tab in VIM 7.  Both the gvimext.dll and its updated source codes are provided in the attached zip file.\n\nI believe this code change will be included in the upcoming VIM release.  So this upload is for the brave and the impatient.\n\nBelow is the usage:\n0.  The new dll will display \"Edit with ... using tabs\" options upon right-click on files in Windows Explorer based on a registry key and the Shift key combination.\n1.  If you don't import UseTab.reg file into registry, gvimext.dll will behave just like before the change.  You can still get the \"using tabs\" options by holding down the Shift key before right-clicking the files.\n2.  Shift key effect\nShift key serves as a toggle key for the \"Edit with ... using tabs\" context menu.  If you hold down the Shift key and then right-click the selected files in Windows Explorer, the opposite of the default Vim context menu will display.\nOnce the Vim content menu displays, you don't need to hold down the Shift key anymore.  Its effect will hold until the next Right-Click.\n",
  "rating_total": "89",
  "rating_votes": "27",
  "downloads": "1223",
  "install_details": "1.  Replace existing gvimext.dll with the updated version.\nMake a backup of your existing gvimext.dll.  You need to make sure that the existing gvimext.dll is not locked before you copy over the new file.  One way to do it is to open an DOS window, go to the directory where gvimext.dll resides, rename the existing file using the below command:\nren gvimext.dll gvimext.old.dll\nand then copy over the new dll (assuming the new dll is at c:\\temp)\ncopy c:\\temp\\gvimext.dll .\nYou need to reboot your machine after this.\nAnother way is to use a tool to kill the process (Windows Explorer) that locks gvimext.dll.  One tool is the \"Process Explorer\" from sysinternals (http://www.microsoft.com/technet/sysinternals/ProcessesAndThreads/ProcessExplorer.mspx)\n2.  UseTab.reg\nThis file will add the following registry value:\n[HKEY_LOCAL_MACHINE\\SOFTWARE\\Vim\\Gvim]\n\"UseTab\"=\"1\"\nThe above value will make the \"Edit with ... using tabs\" context menu as the default menu.\nTo import this registry file, right-click it and choose Merge in Windows Explorer.\n",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=7239",
      "filename": "GvimExt_tab_V2.zip",
      "script_version": "2.0",
      "date": "2007-06-13",
      "vim_version": "7.0",
      "author": {
        "user_id": "11254",
        "user_name": "tianmiao",
        "first_name": "Tianmiao",
        "last_name": "Hu",
        "email": "tianmiao at acm.org",
        "homepage": ""
      },
      "release_notes": "Updated to avoid bell sound when VIM already in command mode."
    }
  ]
}
