{
  "script_id": "1818",
  "name": "Yankcode",
  "summary": "Paste syntax code to webpage quickly",
  "script_type": "utility",
  "description": "Many times when I using my old blog system, I fell in bad mood when I have to mix my source code with content, or no support for source code like syntax highlighted. And when I use vims script TOhtml to deal with these thing, I feel that its handy, but still not enough convenient. I have to choose and copy the html code by my hand, then add a something like <quoteblock class=vimblock>(vimblock is a user-defined CSS element, will be mention later) tag to differentiate these code from common <quoteblock>. Its too inconvenient, also seems easy to be done with a script. So I wrote this.  \n\nWith this script, pasting syntax code is only: \"V\"(selection) and \":Yankcode\" and ctrl-v in editor.\n\nThe script based on TOhtml written by Bram Moolenarr. It convert the current selection to html using 2html, then get the body of html and wrap it with <blockquote class=vimblock>. In the end, it send the wrapped section of syntax code to clipboard for the further use.\n\nWelcome any advice.",
  "install_details": "Copy to your plugin directory.\nYou also need specify CSS for using the code generate by this script.\nThe default CSS of your schema can be generated by TOhtml, though it will only generate the elements that used by current file, you can find a file with most kinds of elements to generate the basis and modify it when you need more elements.\nAfter generation, just copy the section between <! > just below the <style type=text/css>, replace element name body with .vimblock and append it to your CSS file( usually style.css).\nAfter have well defined your CSS, you can use the \"V\"(optional) and \":Yankcode\" and paste to editor with you syntax code in xhtml.\n\nMore  information including my css section and the effect of the script can be found at http://www.yasker.org/en/blog/a-vim-script-for-pasting-syntax-code-to-webpage-33",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=6851",
      "filename": "yankcode.tar.gz",
      "script_version": "0.1",
      "date": "2007-03-09",
      "vim_version": "7.0",
      "author": {
        "user_id": "10667",
        "user_name": "yasker",
        "first_name": "Sheng",
        "last_name": "Yang",
        "email": "yasker at gmail.com",
        "homepage": "http://enblog.yasker.org/"
      },
      "release_notes": "Initial upload"
    }
  ]
}