{
  "script_id": "2031",
  "name": "makeprgs",
  "summary": "Set makeprg and compiler type based on globbed files",
  "script_type": "utility",
  "description": "If you work on several different projects, chances are you will come across Makefile, Ant or SCons based build systems. If you have <F5> mapped to :make with \":nmap <F5> :make<CR>\" then it would be nice if the correct build program were used. That is the purpose of this script. It also maps <F5> as mentioned.\n\nThe script checks if the file SConstruct or SConscript is in the current directory and if so sets the makeprg to scons, or scons -u for scripts.\n\nIf GNUmakefile, makefile or Makefile are found in the current directory, then the makeprg value is set to make.\n\nIf build.xml is found, then \"ant\" is the assumed compiler - i.e. \":compiler ant\" is called.\n\nA global variable makeprgs_make_types can be set to extend the functionality somewhat. Example included in the doc/*.txt file.\n\nThe file detection is pretty crude - it runs a glob in the CWD and if the files are found sets the appropriate value. I hope you find it useful.\n\nTested on Vim 7.0 and 7.1, but should work on earlier releases (6.0 at least).",
  "install_details": "The tar contains plugin/makeprgs.vim and doc/makeprgs.txt, so one should use these commands to install:\n\ncd $HOME/.vim\ntar xzvf /path/to/makeprgs.tar.gz\n\nThen in Vim, run :helptags ~/.vim/doc to generate the help. :help makeprgs will show the help file with extra details on customising.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=7727",
      "filename": "makeprgs-20070928.tar.gz",
      "script_version": "0.1",
      "date": "2007-09-28",
      "vim_version": "6.0",
      "author": {
        "user_id": "13160",
        "user_name": "richardq",
        "first_name": "Richard",
        "last_name": "Quirk",
        "email": "richard.quirk at gmail.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}