{
  "script_id": "2090",
  "display_name": "view_diff",
  "summary": "view diff file in an eaiser way by vimdiff",
  "name": "view_diff",
  "script_type": "utility",
  "description": "Tags: vimdiff svn subversion diff \n\nWHY I WRITE IT:\n  During daily work, I often need to read the result of \"svn diff\" before I commit my work into subversion repository. But only reading the diff result is tedious: sometimes I want to read more context lines; sometimes, when I find some mistake I made in my work, I have to open the file and modify the codes there. On the other hand, vim provide a very good way to view the diff of two versions of file, that is vimdiff, I like it! So f we can use it here that will be very useful. But after some web searching, I did not find anything that can help me here. So the script comes out.\n\nHOW TO USE IT:\n  Normally I use this script in the following way: \n    1. piped svn diff result to vim, for example: \"svn diff | vim - \"\n    2. use shortcuts to open vimdiff modes on current diff file\n    shortcuts: \n        <leader>dv   :   open two versions of file in vimdiff mode\n        <leader>df    :   open  the old/new file \n        <leader>dn   :   open next two versions of file in vimdiff mode in svn diff result file\n        <leader>dp   :   open previous two versions of file in vimdiff mode in svn diff result file\n        <leader>dz   :    fold svn diff result file\n    This script work both for svn diff result and normal diff result. \n\n    There is not more docs till now(maybe more in future), but you can learn this script by trying it :)    \n\n  I need to point out that I am not an experienced vim script programmer and I just want to work out a script that can fulfill my needs. So the codes of script may not be beautiful, but I have used it for several months and it works fine. \n\n  If you have any comment, bug report, patch, please email it to me(linsong DOT qizi AT gmail DOT com), Thanks. \n\n  Happy Vimming! \n\n",
  "rating_total": "17",
  "rating_votes": "5",
  "downloads": "471",
  "install_details": "just put view_diff.vim to $HOME/.vim/plugin folder, that is done. \n\nNOTE: \n   * this script need vim7.0+\n   * this script only works under linux like system(include Mac OS), but not work under windows(may support in future)",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=8033",
      "filename": "view_diff.vim",
      "script_version": "1.0",
      "date": "2007-12-09",
      "vim_version": "7.0",
      "author": {
        "user_id": "4557",
        "user_name": "linsong",
        "first_name": "Vincent",
        "last_name": "Wang",
        "email": "linsong.qizi at gmail.com",
        "homepage": "http://vincent-wang.livejournal.com"
      },
      "release_notes": "Initial upload"
    }
  ]
}
