{
  "script_id": "2168",
  "name": "Doxygen-via-Doxygen",
  "summary": "Generate Doxygen documentation",
  "script_type": "utility",
  "description": "This script allows one to easily generate Doxygen documentation for C and C++ functions. Java could work, I haven\\\\&#039t tested.\n\nThere are many of these scripts available, but I\\\\&#039ve found most are commonly severely restricted by the fact that they parse the C/C++ code themselves. Parsing C++ is hard. Very hard even. I wouldn\\\\&#039t consider parsing code myself, and especially not in VimScript.\n\nSo the trick is this: use Doxygen itself to parse the code, and then parse that output instead. Doxygen can output to XML, which is easily processed further. In this case by applying an XSL transformation. VimScript is used to glue all this together, e.g. move to the correct line number, hightlight/remove the old tag.\n\nAs a result this script has the following nice features:\n- Parses C++ code correctly, regardless of layout, interspersed comments, etc. If Doxygen cannot parse it there\\\\&#039s little need to add a Doxygen tag. See www.doxygen.org for further details if you think you\\\\&#039ve found a bug.\n- Re-uses old Doxygen tags, i.e. generates new tags dropping old items and inserting new ones.\n\nThe maintenance bottleneck is the XSLT file, which should be kept up-to-date to the XML Doxygen outputs. Also, not all markup is kept intact. It is not my intention to make the XSLT file complete, I\\\\&#039m very pragmatic in that sense and I\\\\&#039ll only add what\\\\&#039s actually needed (at the moment: bold, italics, typewriter, (un)ordered lists).\n\nAt the moment I\\\\&#039m looking for developers proficient with both Vim and XSLT who want to give this a spin. This is *alpha* software. I\\\\&#039m releasing it purely in the spirit of Bazaar development. I have not thoroughly tested this script yet. Since I\\\\&#039m more than likely to use my own creation I\\\\&#039ll probably fix bugs and update new versions.\n\nFor all other users: feel free to download and use this. In my humble opinion it\\\\&#039ll serve you at least as good as the scripts already out there. But some hacking may be required.\n\nSources are licensed under the liberal MIT license.",
  "rating_total": "1",
  "rating_votes": "1",
  "downloads": "342",
  "install_details": "Extract the tarball somewhere where .vim files will be read at startup. Edit make_doxygen_tag.vim and edit (at least) the location of the XSLT file.\n\nYou need a XSLT processor and Doxygen!\n\nAs an XSLT processor I\\\\&#039d recommend libxml2\\\\&#039s xsltproc: www.libxml.org\nYou need a recent version of Doxygen (tested with 1.5.5).",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=8356",
      "filename": "make_doxytag.tar.gz",
      "script_version": "0.1",
      "date": "2008-02-27",
      "vim_version": "6.0",
      "author": {
        "user_id": "12839",
        "user_name": "nielsadb",
        "first_name": "Niels",
        "last_name": "Aan de Brugh",
        "email": "nielsadb at gmail.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}