{
  "script_id": "2285",
  "display_name": "vmv",
  "summary": "group rename files from the command prompt with vim",
  "name": "vmv",
  "script_type": "utility",
  "description": "vmv - the vim version of the mv command. This script is in intent exactly the same as renamer.vim, rename a mass of files all at once using the full power of vim's editing capabilities.  Usage is much simpler to remember if you haven't used it in months, and the script itself is much shorter. Great for anybody who just ripped a CD to \"track 01.mp3\" through \"track 12.mp3\", or just inherited a collection of mp3's without proper case and with underscores instead of spaces. \n\nAlso notable is that this will deal with files that start with a - or -- just fine.\n\n\nUsage is simple:\n1. Give it a list of files to be renamed.\n2. Edit that list to reflect what you want the file names to be.\n3. \":wq\" and you're done\n\nHere's a few examples:\n\n#Rename all non-hidden files in the current directory\nlocalhost~$vmv\n\n#Rename all mp3 files below the current directory\nlocalhost~$find | grep  -i '\\.mp3$' | vmv\n\n#Rename all files listed in file \"list.txt\"\n#Note that the file list.txt will be saved as well as files on disk renamed.\nlocalhost~$vmv list.txt\n\nThere are two \"bugs\" that I know of:\n1. It remembers the previous name of the file via line number, so if you add or delete lines bad things may happen.\n2. It renames files directly to the destination filename, so trying to swap filenames will instead overwrite the second with the first, and rename the second as the first. Probably not what you wanted, but the fix is too complicated and the case rare enough that I didn't bother to implement it.\n3. It's fairly slow when writing large lists of files, even if only a few where modified. Some better way of storing the meta-data (i.e. original name) is needed.\n\nThere isn't really much error checking. If the original file name doesn't exist, that line will fail with a message, but it will merrily proceed with the rest of the file. If the destination file name already exists it will overwrite without warning. There is no lifeguard, swim at your own risk. I was going to write fixes for those, and also make it check if the file exists when it's first loaded for editing. I changed my mind because, after all, <sarcasm> I know what I'm doing. </sarcasm> Yes, the 0.1 version number is correct. It's functional, and does what I need it to do, and little else.\n\nIf you enjoy this script, and want it improved, your comments would be helpful.",
  "install_details": "0. ungz and untar the files.\n1. Copy the bash script \"vmv\" into a directory in your path.\n2. Save the vmv.vim file somewhere.\n3. Edit the \"vmv\" bash script to reflect the correct location of vmv.vim.\n4. Use as per examples above.\n\nNote that the suppled shell script uses stty to determine if stdin is a pipe or not, so you'll need a shell and stty to use the script. Most, if not all, unix systems will already have both. The #! at the beginning of the script specifies bash, but it'll probably work with other shell programs as well.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=8891",
      "filename": "vmv.tar.gz",
      "script_version": "0.2",
      "date": "2008-07-06",
      "vim_version": "6.0",
      "author": {
        "user_id": "7072",
        "user_name": "Dorky",
        "first_name": "john",
        "last_name": "gilmore",
        "email": "jgilmore@650dialupcom",
        "homepage": ""
      },
      "release_notes": "removed some debug \"echo\" statements."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=8890",
      "filename": "vmv.tar.gz",
      "script_version": "0.1",
      "date": "2008-07-06",
      "vim_version": "6.0",
      "author": {
        "user_id": "7072",
        "user_name": "Dorky",
        "first_name": "john",
        "last_name": "gilmore",
        "email": "jgilmore@650dialupcom",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
