{
  "script_id": "2307",
  "display_name": "Text (Especially LaTeX) Formatter",
  "summary": "Format text or LaTeX text so that lines have approximately equal lengths",
  "name": "Text-Especially-LaTeX-Formatter",
  "script_type": "utility",
  "description": "This script formats a paragraph of text so that lines have approximately equal length (set by textwidth). It has the following features:\n\n1. It restores logical cursor location (the number of non-space chars from the start of the formatted text). \n\n2. It merges multiple blank lines into one.\n\n3. It is LaTeX aware (many commands and the comments) are recognized (and ignored) so that the source file does not look bad after formatting. It yields better (according to the author :-) results than fmt, or the VIM internal formatter.\n\n4. It can be modified to adapted to your own likes (eg. more ignored code blocks) quite easily (see the functions s:CanJoin, s:BlockStart, s:BlockEnd). \n\n5. It merges multiple spaces into one. (neither fmt nor VIM internal formatter does this). \n\n6. For lines that start with a space/tab, they are not disturbed. \n\n7. It is written in VIM script, so no external programs (awk/fmt/perl) are necessary. This is probably against the UNIX principle. But now that VIM offers scripting capability, one can argue that a VIM script is \"simpler\" (less reading of disk :-). \n\n8. It can be quite easily extended to format a larger chunk of data (more than just a paragraph). Using the s:FormatLines function provided.\n\nComments/Suggestions/Improvements are welcomed. You can leave a comment at \nvim.wikia.com/wiki/User:Lpb612\n\nNote1:  Also take a look at a similar script, Script 2187 http://www.vim.org/scripts/script.php?script_id=2187\n",
  "rating_total": "14",
  "rating_votes": "7",
  "downloads": "497",
  "install_details": "Save the file in the plugin directory (for Unix, this is likely ~/.vim/plugin).\nUse K to format a paragraph in the normal mode. Redefine the mapping in the script (last line) if K is used for something else. \n\nIf you want to use it to format only .tex files only, then save the file in ./vim/ftplugin/tex.vim (or append to the end of that if it exists already). ",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9035",
      "filename": "format.vim",
      "script_version": "0.32",
      "date": "2008-07-27",
      "vim_version": "6.0",
      "author": {
        "user_id": "14811",
        "user_name": "lpb612",
        "first_name": "",
        "last_name": "lpb612",
        "email": "lpb612 at gmail.com",
        "homepage": "http://URL at   vim.wikia.com/wiki/User:Lpb612"
      },
      "release_notes": "a small bug is corrected that affect how many paragraphs are formatted (should be one, but was two)."
    }
  ]
}
