{
  "script_id": "2345",
  "display_name": "Vimchant",
  "summary": "Fast on-the-fly spell-checker based on Enchant",
  "name": "Vimchant",
  "script_type": "utility",
  "description": "Vim 7.0 introduced excellent spell-checking features which made external spell-checker plugins pretty much obsolete. Unfortunately not all languages can be supported through Vims dictionary format. Either the language is morphologically too complex or better custom solutions exist already for some languagessolutions which are not compatible with Vims spelling checker. Finnish, for example, is a language which doesnt currently benefit from Vims spell-checking features.\n\nThis plugin (Vimchant) provides a simple but fast on-the-fly spelling checker which uses Enchant as its back-end program. Enchant is a spell-checker library and utility included in modern GNU/Linux systems. Enchant itself is only a front-end for many different spell-checkers, including Voikko, Zemberek, Hunspell, Hspell, Uspell, Myspell, Aspell and Ispell. All the spell-checkers and languages which can be supported through Enchant are available to Vim through this plugin.\n\nManual for Vimchant is included, just type\n\n    :help vimchant.txt\n\nThe most interesting commands are \\ss (spell-checker on/off) and \\sl (change language). The default interval period before running the spell-check is rather long (4 seconds). To make the spell-checker respond faster (1 second, for example) add the following line to your .vimrc file:\n\n    set updatetime=1000\n\nSee the manual for more info. See also the Enchant homepage:\n\n    http://www.abisource.com/projects/enchant/\n",
  "install_details": "Requirements:\n\n     Vim 7.1.040 or later\n     Enchant (possibly included in libenchant package in GNU/Linux distributions)\n\nThe plugin uses Vimball plugin archive format (vimscript#1502). To install the package, load the file to Vim and run command\n\n    :source %\n\nTo remove the plugin, type\n\n    :RmVimball vimchant",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9199",
      "filename": "vimchant.vba",
      "script_version": "1.1",
      "date": "2008-08-31",
      "vim_version": "7.0",
      "author": {
        "user_id": "14890",
        "user_name": "DtW",
        "first_name": "Teemu",
        "last_name": "Likonen",
        "email": "tlikonen at iki.fi",
        "homepage": ""
      },
      "release_notes": "Move the most part of the plugin to autoload directory. Now only the very minimum of this plugin is loaded automatically when Vim is started and the rest is loaded when the spell-checker is used for the first time."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9151",
      "filename": "vimchant.vba",
      "script_version": "1.0",
      "date": "2008-08-19",
      "vim_version": "7.0",
      "author": {
        "user_id": "14890",
        "user_name": "DtW",
        "first_name": "Teemu",
        "last_name": "Likonen",
        "email": "tlikonen at iki.fi",
        "homepage": ""
      },
      "release_notes": "* U+005F (_) is now interpreted as a word separator\n* Update GetLatestVimScripts header"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9138",
      "filename": "vimchant.vba",
      "script_version": "0.9",
      "date": "2008-08-17",
      "vim_version": "7.0",
      "author": {
        "user_id": "14890",
        "user_name": "DtW",
        "first_name": "Teemu",
        "last_name": "Likonen",
        "email": "tlikonen at iki.fi",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
