{
  "script_id": "2446",
  "display_name": "narrow -- Kramer",
  "summary": "Another plugin that emulates emacs' narrowing feature.",
  "name": "narrow--Kramer",
  "script_type": "utility",
  "description": "This plugin allows you to zoom into regions of a buffer by hiding everything outside the selection. Global operations like global search/replace etc. only apply to the selected region, until you widen the view again. This is useful when you have a very long function that doesn't fit the screen, and you end up in another function when searching whithout noticing (as an example). With this plugin you can zoom to that function and be sure that you keep inside it, no matter what you do.\n\nCommands:\n:Narrow (takes a region, zooms to it)\n:Widen (inserts the hidden parts again)\n\nNotes:\nAs the Narrow function actually deletes the hidden text from the buffer temporarily, this action can be undone manually by the user (using \"u\", \":undo\", \":earlier\", \"g-\", ...), which will break the :Widen function. For this reason, the 'u' key is remapped to a \"safe\" undo function. Still, there are other ways to undo the narrowing, so be careful!\nAlso, when in a narrowed buffer, the auto-command \"BufWriteCmd\" is set to a function that saves the whole file, so not only the narrowed region is saved on \".w\". Don't mess with this auto-command, or you'll probably lose data!",
  "install_details": "Just copy the script in your plugin folder.\n\nThe latest version can also be checked out of the Git repository at http://github.com/jkramer/vim-narrow/tree/master",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9513",
      "filename": "narrow.vim",
      "script_version": "0.1",
      "date": "2008-11-17",
      "vim_version": "7.0",
      "author": {
        "user_id": "15535",
        "user_name": "cahne6Ki",
        "first_name": "Jonas",
        "last_name": "Kramer",
        "email": "jkramer@nex.scrapping.cc",
        "homepage": "http://nex.scrapping.cc/"
      },
      "release_notes": "Initial upload"
    }
  ]
}
