{
  "script_id": "2502",
  "display_name": "fly.vim",
  "summary": "An integrated code development environment (incl. Cscope, Web Search, Man Pages)",
  "name": "fly.vim",
  "script_type": "utility",
  "description": "User Guide: \n        http://www.scribd.com/doc/9662346/flyvim\n        Also included in the tar ball.\n\nSummary:\n\nfly.vim is a vim plugin that may enhance your vim experience (and productivity) with an integrated code development environment. The plugin facilitates rapid code-walkthrough (or flythrough as I call it), enables instant symbol searches and cross references in a large code base, manages stacks of multiple files, includes buffer and directory explorer and integrates code reviews and compilation, all within a simple and intuitive user interface.\n\nfly.vim integrates seamlessly with source code index databases (Cscope for now), web search engines (Google and Yahoo) and UNIX man pages. Most functions are mapped to shortcut keys, allowing you to fly through a large code base or web in a convenient manner. Using the shortcut mappings, you may search for symbols (or multi-word phrases) after visually highlighting them, or by typing them on vim command line or by taking the cursor to the symbol in a vim window.\n\nAlthough there are quite a few features to talk about as you will find in the User Guide, it is very easy to get started,\n\n\tDownload and place the fly.vim in your $HOME/.vim/plugin\n\tChange directory (cd) to the root of the source tree (or subtree)\n\tLaunch vim. Start using the plugin.\n\nThe plugin has been in use on Linux and FreeBSD with vim 6.x and 7.y.",
  "rating_total": "48",
  "rating_votes": "16",
  "downloads": "693",
  "install_details": "The tar ball contains fly.vim (the plugin) and the User Guide. After inflating the tar ball, the plugin needs to be placed in $HOME/.vim/plugin.\n\nAfter the installation please follow the steps in chapter 7 (of the User Guide) to get started. You may use chapter 6 as a Quick Reference Sheet for features.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9767",
      "filename": "fly.tgz",
      "script_version": "1.16",
      "date": "2009-01-06",
      "vim_version": "6.0",
      "author": {
        "user_id": "15750",
        "user_name": "fly.vim",
        "first_name": "fly",
        "last_name": "vim",
        "email": "fly.vim at live.com",
        "homepage": ""
      },
      "release_notes": "Incorporated received comments, fixed a bug and added cursorline for vim 7+."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=9741",
      "filename": "fly.tgz",
      "script_version": "1.0",
      "date": "2009-01-01",
      "vim_version": "6.0",
      "author": {
        "user_id": "15750",
        "user_name": "fly.vim",
        "first_name": "fly",
        "last_name": "vim",
        "email": "fly.vim at live.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
