{
  "script_id": "2570",
  "name": "vimdecdef",
  "summary": "Switch between C++ declarations and definitions",
  "script_type": "ftplugin",
  "description": "http://github.com/eddic/vimdecdef\n\nFirst off I would grab the vimdecdef.vim file from the above address\ninstead of the tarballed one as it may be out of date.\n\nvimdecdef is a simple vim script that facilitates transitioning between\ndeclarations and definitions in C++. The script can take a declaration and\neither find it's definition or create one if it doens't exist. The definitions\nwill take into account scope and template. All script actions will utilize one\nof two files. The header file and the source file. Initilially one should\nalways load a header file. If for example one executed ':e include/file.hpp'\nthen the script will automatically assume that the source file is located at\nsrc/file.cpp. The script has a single bindable command that preforms the\nfollowing functions based on it's situation:\n\n * If the cursor is on a normal function activating the script will search the\n   source file for it's definition. If the definition does not exist, it will\n   append one at the bottom of the source file and leave the cursor there.\n * If the cursor is on an inline or template function activating the script will\n   search the source file for it's definition. If it is found in the source\n   file, the cursor will be positioned there. If the definition is not found in\n   the source file the script will try to find it in the header file. If it is\n   found in the header file, the cursor will be positioned there. If it is not\n   found, one will be appended to the bottom of the header file insuring that it\n   stays within any closing #endif that may exist.\n * If the cursor is on a global object or static data member the script will\n   search the source file for it's definition. If the definition does not exist,\n   it will append one at the bottom of the source file and leave the cursor\n   there.\n * If the script's last action ended in a definition in the header file,\n   activating it again will move the cursor back to the original declaration\n   that caused the previous move regardless of the cursors current position.\n * Activating the script at any point in the header file that doesn't fall under\n   any of the above circumstances will result in switching to the source file at\n   it's last cursor position.\n * Activating the script while in the source file will always result in\n   switching back to the header file at it's last cursor position.",
  "install_details": "First copy vimdecdef.vim into your ~/.vim/ftplugin/cpp directory. You may want\nto enable hidden (:set hidden) while using the script as it tends to work in a\nprettier way. You will want to set up a map for the command. I like having it\nbound to <F7> so to accomplish that it's a simple matter of:\n\nmap <silent> <F7> <Plug>vimdecdef\n\nWith everything setup we can get started. Note all paths are relative. Say we\nhave a header file located at include/somelibrary/file.hpp. Our first step\nwill be to load it into vim. Always load the header file first.\n\nvim include/somelibrary/file.hpp\n\nNow the script will assume the source file is located at src/file.cpp. Simple\npress <F7> at a blank line and the source file will be loaded. Press it again\nand you will switch back to the header file. Hit <F7> at a declaration, and\nspecial things discussed above will happen.\n\nThere are two customizable options: source file prefix and source file\nextension. The default definitions follow.\n\nlet g:vimdecdefSourceExtension = \"cpp\"\nlet g:vimdecdefSourcePrefix = \"src/\"",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=10126",
      "filename": "vimdecdef.zip",
      "script_version": "1.01",
      "date": "2009-03-05",
      "vim_version": "7.0",
      "author": {
        "user_id": "16817",
        "user_name": "eddic",
        "first_name": "Eddie",
        "last_name": "Carle",
        "email": "eddie at erctech.org",
        "homepage": ""
      },
      "release_notes": "To appease the windows users"
    }
  ]
}