{
  "script_id": "2599",
  "name": "todolist.vim - Talevich",
  "summary": "Highlights a plain-text to-do list to keep it manageable",
  "script_type": "syntax",
  "description": "I use my to-do list as a dumping ground for text and notes, so as long-term ideas pile up my lists will inevitably blow up into hundreds or thousands of lines. This is the natural order of things, and vim with proper highlighting and formatting makes it manageable. I also prefer my text lit up like a Christmas tree.\n\nHighlighted:\n -  lines ending with a colon (\":\")\n -  lines prefixed by an asterisk (\"*\")\n -  from a left curly brace (\"{\") to the end of the line\n -  numbers\n -  standard panic words: TODO, XXX, and others\n -  a few common words that merit emphasis (yes, no, not, ...)\n -  a personalized list of words, e.g. names of friends and co-workers (customizing this will be made easier in a later release)\n\nFollowing the GTD approach is possible:\n\n    project -- end the line with a colon, and indent the tasks\n\n    tasks -- plain text, or starting with a dash, it doesn't matter.\n            (copy and paste is expected to work without reformatting.)\n\n    note -- prefix the line with an asterisk to highlight it in the\n            same style as source code comments. (for 1-liners.)\n\n    contexts -- I keep project definitions small and group them under\n            categories that can be used as keywords. Specifically, I\n            start a new category with a line of underscores and a curly\n            brace before the category name(s) and tags. The }} and {{\n            vim keybindings then work as expected, and * and # work for\n            finding matching category tags within other text.\n",
  "rating_total": "3",
  "rating_votes": "3",
  "downloads": "501",
  "install_details": "Copy the file todolist.vim into your ~/.vim/syntax directory. To trigger automatic highlighting, write the following line at the bottom of a file:\n\nvim: ft=todolist\n\nThe extension of your file doesn't matter, just the content.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=10341",
      "filename": "todolist.vim",
      "script_version": "0.1",
      "date": "2009-04-02",
      "vim_version": "6.0",
      "author": {
        "user_id": "17090",
        "user_name": "etal",
        "first_name": "Eric",
        "last_name": "Talevich",
        "email": "eric.talevich at gmail.com",
        "homepage": "http://etalog.blogspot.com/"
      },
      "release_notes": "Initial upload"
    }
  ]
}
