{
  "script_id": "2826",
  "name": "multisearch.vim",
  "summary": "Search + highlight multiple search terms",
  "script_type": "utility",
  "description": "I routinely need to examine log files from production, and found the need to highlight and search multiple terms during the process. I took ideas from such scripts such as Highlighter.vim, MultipleSearch.vim and MultipleSearch2.vim and created a script to help me with the above task. In April, 2008, I rewrote the script virtually from scratch and over the last year and a half improved its functionality. I now submit the result of my efforts for the benefit of the Vim community.\n\nMulti Search enables highlighting (and searching) multiple search terms. Each defined search term's highlight state can be enabled or disabled. Searches can be performed on all the defined terms, all enabled terms, or on specific terms.\n\nOn platforms that support it, the Multi Search menu makes it easier to use some of the Multi Search commands. Multi Search also defines mappings for the more commonly used commands.\n\nAlthough it is marked as requiring Vim 7.2, the Multi Search plugin was developed and tested using Vim 7.1. Please see the installation instructions below. Once installed, detailed help can be obtained by\n\n\t:help Msearch\n\nEmail bug reports and enhancement requests to the author. Happy Viming!",
  "rating_total": "1",
  "rating_votes": "5",
  "downloads": "206",
  "install_details": "Multi Search comes packaged as a Vimball file. Source the vimball file to extract its contents:\n\n\t\t% vim multisearch.vimball\n\t\t:source %",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=11627",
      "filename": "multisearch.vimball",
      "script_version": "0.8-unix",
      "date": "2009-10-30",
      "vim_version": "7.0",
      "author": {
        "user_id": "18244",
        "user_name": "mitanu",
        "first_name": "Mitanu",
        "last_name": "Paul",
        "email": "mitanu at gmail.com",
        "homepage": ""
      },
      "release_notes": "Updated with a vimball file with fileformat=unix so that it can be unpacked in non-DOS platforms. If you had trouble unpacking the vimball provided with the initial upload, please try again."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=11601",
      "filename": "multisearch.vimball",
      "script_version": "0.8",
      "date": "2009-10-27",
      "vim_version": "7.2",
      "author": {
        "user_id": "18244",
        "user_name": "mitanu",
        "first_name": "Mitanu",
        "last_name": "Paul",
        "email": "mitanu at gmail.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}