{
  "script_id": "2949",
  "display_name": "The Max Impact Experiment",
  "summary": "A playground to see how much we can do with pithy code",
  "name": "The-Max-Impact-Experiment",
  "script_type": "utility",
  "description": "The other day I was sitting around drinking beer and thinking, \"Gosh, I hate how long it takes for the list of buffers to show up on the screen when I type :ls. I wish there was a built-in command that quickly opens a window with a list of buffers. Like a :bopen command that works just like the :copen and :lopen commands...\" Then it hit me. Yes, the Frisbee hit me right on the melon and I had to get off my lawn chair to throw it back. When I sat back down I had an idea... The buffer list is a perfect use of the location list! Its got file names... even line numbers! Well, I took out the laptop that I was laying on, brushed off the sand and experimented with it. So... How much work did it take to create a location list containing buffers? Precious little it turns out... \n\nHere's the jist of it... \n\n\" 1. place the output of the ls command into a variable... \n   redir => out \n   silent ls \n   redir END \n\n\" 2. split the string into an array... \n   let l = split(out, '\\n') \n\n\" 3. set the error format to conform to the buffer list format... \n   set efm=%m\\\"%f\\\"%*\\\\sline\\ %l \n\n\" 4. create a location list based on the list of buffers, then open the window... \n   lgetexpr l \n   lopen \n\nBlam! That's it! Now I've got a window that lists buffers, and selecting one of them will take me right to it! Granted, it's raw. But it works and it only took 7 lines of code! \n\nThen I had another loathsome thought as I was rubbing the bump on my forehead... There are many pretty, feature-rich buffer scripts out there. So what use is this? \n\nNow, either I had too much to drink or the Frisbee hit me harder that I thought because my darth-vader pug (http://bboylimping.files.wordpress.com/2009/05/darth-vader-dog-costume.jpg) started arguing with me. He said, \"Because you are using the built-in location list, vim will take care of buffer selection for you, even window management, and all the location list commands are at your disposal!\" \n\nHoping that nobody could see me arguing with Darthy I said, \"Yea, so what? There are other scripts out there that have a much prettier buffer list, have more features...\" \n\n\"Shut up! he said, interrupting me. \"It isn't about that. It's about doing as much as you can with as little code as possible.\" \n\nKnowing that he was right and humiliated that my dog beat me in an argument, I threw the Frisbee as hard as I could and hoped that he would leave me alone. It didn't work. He just sat there and stared at me with a look that said \"you're so immature...\" \n\n\"Now, post it!\" \n\"Hell no!\" I said with a scoff. \"Who do you think you are? You're a no-talent-ass-clown pug in a Darth-Vader costume! You're not fooling anyone, you know. Oh, and news flash: you missed the Men in Black auditions by 15 years.\" \n\nHe just stared at me with a judgmental look on his face. Not wanting to give him the satisfaction, I casually turned over with a yawn so he couldn't see me post the script. \n\nSo, here it is... I've added only a *minimum* collection of useful features to the buflist. I've refined the hell out of it; smoothing out the worst of the rough edges. No feature takes more than a few lines of code, the whole thing is only about 70-75 lines. \n\nWhy have this experiment? Well... there are some important advantages to keeping things short: \n- There are fewer places for bugs to hide. \n- The code runs considerably faster because it leverages more of the native C code.\n- It is easier to understand (usually). \n- It is easier to fix bugs. \n- A sufficient level of obfuscation adds to job security... and \n- It saves $0.000000001 in hard-drive space. \n\nDownload it and take a look at it. Play around with it. Adore the elegance of it. Can you think of any other features to add?\n\nDarthy: \"Arff! You can do it!\" Aww, crap... he caught me. \n\nFeel free to contact me with ideas and updates (take a look at my profile for the email). \n\nFor those of you who are expecting the world's best buffer script, then give a negative rating... hey lighten up! This is just a fun exercise! Please add a comment before rating! Comments can be posted on the corresponding wiki page (see link at the top of this page).",
  "rating_total": "16",
  "rating_votes": "10",
  "downloads": "228",
  "install_details": "Drop it in your plugin directory.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12503",
      "filename": "buflist.vim",
      "script_version": "0.2a",
      "date": "2010-02-26",
      "vim_version": "7.0",
      "author": {
        "user_id": "801",
        "user_name": "bluebottle",
        "first_name": "David",
        "last_name": "Larson",
        "email": "david at thesilverstream DOT com",
        "homepage": "http://www.thesilverstream.com"
      },
      "release_notes": "You can now change the mapping to open the buffer list by setting the buflist_open variable. Added usage documentation."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12369",
      "filename": "buflist.vim",
      "script_version": "0.2",
      "date": "2010-02-12",
      "vim_version": "7.0",
      "author": {
        "user_id": "801",
        "user_name": "bluebottle",
        "first_name": "David",
        "last_name": "Larson",
        "email": "david at thesilverstream DOT com",
        "homepage": "http://www.thesilverstream.com"
      },
      "release_notes": "Found that if I use an autocommand to close the window it simplified the script a lot! It is only about 29 lines long now! (ignoring empty lines) "
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12300",
      "filename": "buflist.vim",
      "script_version": "0.1aa",
      "date": "2010-02-04",
      "vim_version": "7.0",
      "author": {
        "user_id": "801",
        "user_name": "bluebottle",
        "first_name": "David",
        "last_name": "Larson",
        "email": "david at thesilverstream DOT com",
        "homepage": "http://www.thesilverstream.com"
      },
      "release_notes": "Bug fix: sometimes shortening a path made it longer. \nStrengthened my resolve to add only pithy features. (I almost gave in to the temptation of adding custom highlighting that was of little to no use and was several lines long... but I stood strong. Thank you for your prayers.)"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12269",
      "filename": "buflist.vim",
      "script_version": "0.1a",
      "date": "2010-02-01",
      "vim_version": "7.0",
      "author": {
        "user_id": "801",
        "user_name": "bluebottle",
        "first_name": "David",
        "last_name": "Larson",
        "email": "david at thesilverstream DOT com",
        "homepage": "http://www.thesilverstream.com"
      },
      "release_notes": "Added more comments and obfuscation."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12217",
      "filename": "buflist.vim",
      "script_version": "0.1",
      "date": "2010-01-28",
      "vim_version": "7.2",
      "author": {
        "user_id": "801",
        "user_name": "bluebottle",
        "first_name": "David",
        "last_name": "Larson",
        "email": "david at thesilverstream DOT com",
        "homepage": "http://www.thesilverstream.com"
      },
      "release_notes": "Initial upload"
    }
  ]
}
