{
  "script_id": "3024",
  "display_name": "vimake",
  "summary": "Vimake is a programming aid written in C++ for Linux",
  "name": "vimake",
  "script_type": "color scheme",
  "description": "Ever wanted to edit/compile/assemble/link and debug, then run the completed program all inside one Vim or Gvim editing session. With Vimake you can do this and much more, no need to write Makefiles, no need to exit vim to test your programs, it can all be done using just a few function keys.\nVimake is a programming aid which can build files in C, C++, as(Gas) & Nasm This allows single or mixed language programs to be built at the touch of a  key. You can also write, test and run bash, perl, ruby, and python scripts all\nwhilst in a normal Vim or Gvim session. Used with Vim&#039s QuickFix function it turns Vim into a powerful programming environment.\n~    ",
  "install_details": "copy  the package to your home directory then run\ntar -zxvf vimake-1.12.tar.gz.\nChange directory to the doc sub-dir of the package then\nuse \\\"install.html\\\" for detailed installation instructions.\nvimake package contains a demonstration and detailed tutorial.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=14290",
      "filename": "vimake-1.15.tar.gz",
      "script_version": "1.15",
      "date": "2010-11-17",
      "vim_version": "7.0",
      "author": {
        "user_id": "8430",
        "user_name": "mikeofthenight",
        "first_name": "michael",
        "last_name": "lear",
        "email": "mikeofthenight2003@yahoo.com",
        "homepage": ""
      },
      "release_notes": "Fixed BUG where viclean removed any executable shell scripts from the project dir. This was because stat\nreturns true on all executable files. Added further test to skip all exectable shell scripts.\nReplaced incorrect version of utils.cc with latest version.\nA full installation guide  and tutorial is included in the doc directory. To build this version copy the package to your home directory then run: tar zxvf vimake-1.15.tar.gz.\n"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=14271",
      "filename": "vimake-1.14.tar.gz",
      "script_version": "1.14",
      "date": "2010-11-15",
      "vim_version": "7.0",
      "author": {
        "user_id": "8430",
        "user_name": "mikeofthenight",
        "first_name": "michael",
        "last_name": "lear",
        "email": "mikeofthenight2003@yahoo.com",
        "homepage": ""
      },
      "release_notes": "Vimake,    compile-assemble-link-run-debug a file or files in a vim session with hot keys.\nThis version of vimake has many improvements over the earlier version. It now can load,build and run\nin a vim session lua. It can automatically switch the ddd front end debugger to load the following\nfile types. Asm, C/CPP, Bash, Python and Perl. It can also run the ruby debugger and the other script languages  in a vim shell. A full installation guide  and tutorial is included in the doc directory. To build this version copy the package to your home directory then run: tar zxvf vimake-1.14.tar.gz.\nChange directory to $HOME/vimake-1.14 and follow the README instructions.\n"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12670",
      "filename": "vimake-1.12.tar.gz",
      "script_version": "1-12",
      "date": "2010-03-20",
      "vim_version": "6.0",
      "author": {
        "user_id": "8430",
        "user_name": "mikeofthenight",
        "first_name": "michael",
        "last_name": "lear",
        "email": "mikeofthenight2003@yahoo.com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
