{
  "script_id": "3026",
  "display_name": "PickAColor.vim",
  "summary": "Inserts and edits color codes using a color name or a graphic color chooser.",
  "name": "PickAColor.vim",
  "script_type": "utility",
  "description": "The PickAColor plugin is an attempt to make inserting or modifing colors easier. With it you can use the GTk or Mac OS X color chooser or a color name to insert or modify an existing color code. It borrows heavily from vimscript #3014 and vimscript #2756.\n\nIt provides four commands that will insert the corresponding code:\n- :PickHEX\n- :PickHSL\n- :PickRGB\n- :PickRAW\n\nYou can give a color name as an argument with the command and it will be translated to its corresponding code. You can set which set of color names to use, either web or X11, with the option g:pickacolor_use_web_colors.\n\nUsing any of the commands without arguments will open the Mac OS X (if working on a mac) or GTK (if available) color chooser dialog.\n\nWhen the cursor is on a hexadecimal color code or a color name, it will be replaced with the new color. If you open the color chooser, it will load the current color. This feature can be disabled with g:pickacolor_edit_names and g:pickacolor_edit_hex.\n\nIf there is no hexadecimal color code or a color name under the cursor, the clipboard will be read and parsed for one and it will be used for the color chooser dialog.\n\nWhen you edit or insert a color, the code will be also loaded into the clipboard (under X11 the selection clipboard will be used).\n\nBoth features can be disabled with g:pickacolor_set_clipboard and g:pickacolor_get_clipboard.\n\nThe color name supported are those listed in the following sources:\n\nWeb color names:\n  http://www.w3.org/TR/css3-color/#svg-color\n\nX11 color names:\n  http://cvsweb.xfree86.org/cvsweb/xc/programs/rgb/rgb.txt?rev=1.2\n\nRead :help PickAColor for more details.",
  "rating_total": "5",
  "rating_votes": "2",
  "downloads": "117",
  "install_details": "requirements:\nThe script requires Vim 7.2 or later and Python 2.5 or later with the PyGTK module and GTK.\n\nThis script is packaged as a vimball. If gnuzip is in your $PATH, simply edit PickAColor.vba.gz in Vim and then source the file; otherwise, decompress the archive first.\ne.g.:\n        vim PickAColor.vba.gz\n        :source %\n\nIf you want to remove this plugin, type the following inside Vim:\n\n        :RmVimball PickAColor\n\nIf you have GetLatestVimScripts configured, PickAColor will be automatically added the next time you run :GetScripts. ",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12692",
      "filename": "PickAColor.vba.gz",
      "script_version": "1.1",
      "date": "2010-03-23",
      "vim_version": "7.0",
      "author": {
        "user_id": "15099",
        "user_name": "Raimondi",
        "first_name": "Israel",
        "last_name": "Chauca Fuentes",
        "email": "israelvarios at fastmail.fm",
        "homepage": "http://cachivaches.chauca.net/"
      },
      "release_notes": "- Fixed some typos and noisy output. Thanks to Steve\n  Huff for pointing this out.\n- If GTK is not available and the plug-in is not\n  running under Mac OS X, the commands still will work with\n  color names."
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=12682",
      "filename": "PickAColor.vba.gz",
      "script_version": "1.0",
      "date": "2010-03-23",
      "vim_version": "7.0",
      "author": {
        "user_id": "15099",
        "user_name": "Raimondi",
        "first_name": "Israel",
        "last_name": "Chauca Fuentes",
        "email": "israelvarios at fastmail.fm",
        "homepage": "http://cachivaches.chauca.net/"
      },
      "release_notes": "Initial upload."
    }
  ]
}
