{
  "script_id": "3172",
  "name": "SyntaxComplete",
  "summary": "OMNI Completion based on the current syntax highlights",
  "script_type": "utility",
  "description": "SyntaxComplete.vim is a plugin which uses the new Vim7 OMNI completion features (intellisense code completion).\n\nSyntaxComplete.vim version 5.0 is included in the Vim 7.2 release.\nSyntaxComplete.vim version 7.0 is included in the Vim 7.3 release.\n\nWhat does it do:\n-----------------------\nVim has the ability to color syntax highlight nearly 500 languages.  Part of this highlighting includes knowing what keywords are part of a language.  Many filetypes already have custom completion scripts written for them, the syntaxcomplete plugin provides basic completion for all other filetypes.  It does this by populating the omni completion list with the text Vim already knows how to color highlight.  It can be used for any filetype and provides a minimal language-sensitive completion.\n\nThere are not many languages with full blown OMNI completion scripts written in Vim.  Yet, having a list of functions and keywords to complete can be very handy especially when you are working with a predefined API.\n\nAdding the following to your .vimrc, will setup SyntaxComplete for every filetype that does not already have a language specific OMNI script:\n\n    if has(\"autocmd\") && exists(\"+omnifunc\")\n\tautocmd Filetype *\n\t\t    \\\tif &omnifunc == \"\" |\n\t\t    \\\t\tsetlocal omnifunc=syntaxcomplete#Complete |\n\t\t    \\\tendif\n    endif\n\n\nIt also provides some public functions so other plugin writers can pull syntax keywords (based on group names) from Vim and utilize them in any manor.  Examples are included in the help files, but here is a simple example:\n    let myKeywords = []\n    let myKeywords = OmniSyntaxList( ['sqlKeyword'] )\n    let allItems = OmniSyntaxList( [] )\n\n\nExisting instructions can be found within Vim7 using\n:h ft-syntax-omni\n\nThis plugin is new to Vim7.  Improvements to the script will be uploaded here, and supplied to Bram for inclusion into future versions of Vim7.\n \n",
  "install_details": "install details\nCopy syntaxcomplete.vim to:\n.vim/autoload/syntaxcomplete.vim (Unix)\nvimfiles\\autoload\\syntaxcomplete.vim (Windows)\n\nFor documentation:\n:h ft-syntax-omni ",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=13428",
      "filename": "syntaxcomplete.vim",
      "script_version": "7.0",
      "date": "2010-07-29",
      "vim_version": "7.0",
      "author": {
        "user_id": "837",
        "user_name": "fishburn",
        "first_name": "David",
        "last_name": "Fishburn",
        "email": "dfishburn dot vim at gmail dot com",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}