{
  "script_id": "3194",
  "name": "ovim",
  "summary": "open files in running gvim from a terminal",
  "script_type": "utility",
  "description": "ovim is a zsh script that makes it convenient to open files\nor execute \"ex\" commands in gvim from a Unix terminal.\n\nExamples:\n\nOpen all c files and jump to the first \"main\" string:\n    ovim *.c +/main\n\nOpen all cpp files that contain the \"sstream\" string:\n    grep -l sstream *.cpp | xargs ovim\nor\n    ovim -c vimgrep sstream *.cpp\n\nOpen the README.txt file in a new window:\n    ovim -c split README.txt\n\nMake gvim jump to a tag with respect to the \"tags\" file\nin the shell directory (try this in /usr/share/vim/vim72/doc):\n    ovim -c tag /grail\n\nChange to the current shell directory in gvim:\n    ovim -c cd .\n\nOpen all txt files in the gvim server MYGVIM.  The server name is\ncapitalized thus \"-s mygvim\" is the same as \"-s MYGVIM\":\n    ovim -s mygvim *.txt\n\nMake gvim a bit animated:\n    ovim -c \"winpos \"{1..400}\" 1|\"\n\nFeautures:\n\n* speed \"gvim --remote f1 f2 f3 ... f50\" could cause about 10 second screen\nupdates in some older gvim versions.  With ovim gvim sources a temporary\nscript file and avoids such slow downs.\n\n* intelligent server selection.  ovim attempts to reuse\nthe last server used, if it is not running, it will select the last live\ngvim server or finally would start new gvim process.  The server\nselection can be forced with a \"-s MYSERVER\" option.  Note that this\nserver choice is permanent, i.e., subsequent calls of ovim would try\nto use the same server.\n\n* \"ex\" commands are executed in the current shell directory\n\"ovim -c split filename\" works even if terminal and the gvim server are\nin different directories.  The gvim directory is changed to the terminal\ndirectory just before the ex commands execution and then restored back.\nThis is done in such way that \"ovim -c cd somewhere\" works as expected.\n",
  "install_details": "Copy the script file to $HOME/bin/ or to some other directory\nin the PATH and make it executable using \"chmod +x ovim\".  \nMake sure the zsh shell is installed, it is usually available\nas a \"zsh\" package in recent Linux distributions.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=13534",
      "filename": "ovim",
      "script_version": "161",
      "date": "2010-08-10",
      "vim_version": "7.0",
      "author": {
        "user_id": "358",
        "user_name": "pavol",
        "first_name": "Pavol",
        "last_name": "Juhas",
        "email": "juhas at seas.upenn.edu",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}