{
  "script_id": "3279",
  "display_name": "ProjectParse",
  "summary": "Parse common project types to augment the project plugin",
  "name": "ProjectParse",
  "script_type": "utility",
  "description": "*** Summary ***\n\nProjectParse is a plugin that analyzes several common project formats and creates entries for them for use with  Vim's `project` plugin.  ProjectParse will also watch the specified project and automatically update it's entry when the project changes. ProjectParse currently supports the following project types:\n\n    * Microsoft Visual Studio Projects and Solutions\n    * Code::Blocks Projects and Workspaces\n    * Automake Makefiles\n    * MPLAB Projects\n    * CodeLite Projects\n    * (More to come!)\n\nBy simply running the :ProjectParse command on a relevant file, a file listing will be added to a user's configuration for the `project` plugin and will be kept up to date.\n\n*** Motivation ***\n\nOne of the most popular plugins available for Vim, the `project` plugin vimscript #69 provides a mechanism for creating lists of files that makeup a project. Beyond just giving you a file listing, it provides some great functionality such as automatically opening your project files, grepping through each file in the list, and running arbitrary commands on these files.                \n\nThe project plugin creates a project by scanning through the user's filesystem for files that match a specified pattern.  This approach, while effective for some projects, isn't optimal for others.  Often, the filesystem may contain files that match the specified pattern but are not a part of the project (such as temporary files or older revisions of relevant files).  Also, when the user's filesystem is large, generating the list of files can be quite time-consuming (I've had projects with 1,500 relevant files in a directory of 30,000 files, where >28,000 files are analyzed unnecessarily).  Another problem is that by relying on a pre-configured file pattern, certain important files can be missed when they are not part of the configured pattern, especially as projects evolve.\n\nOften, software developers already have a list of their relevant files in the form of a project for a well-known software tool like Microsoft Visual Studio. This is where ProjectParse enters.  ProjectParse is capable of analyzing project files for several popular software tools to automatically (and quickly) create a project for the `project` plugin.",
  "install_details": "Copy ProjectParse.vim to your plugin directory; copy ProjectParse.txt to your doc directory.  Run helptags on your doc directory.",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=14292",
      "filename": "ProjectParse.zip",
      "script_version": "1.1a",
      "date": "2010-11-18",
      "vim_version": "7.0",
      "author": {
        "user_id": "15016",
        "user_name": "danprice",
        "first_name": "Daniel",
        "last_name": "Price",
        "email": "vim@danprice.fastmail.net",
        "homepage": ""
      },
      "release_notes": "Fixed a typo that prevented Visual Studio parsing from working"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=14278",
      "filename": "ProjectParse.zip",
      "script_version": "1.1",
      "date": "2010-11-17",
      "vim_version": "7.0",
      "author": {
        "user_id": "15016",
        "user_name": "danprice",
        "first_name": "Daniel",
        "last_name": "Price",
        "email": "vim@danprice.fastmail.net",
        "homepage": ""
      },
      "release_notes": "Added automatic update of projects upon a change to the project file.\n  - Projects will need to be reparsed to support this functionality\nAdded support for CodeLite projects\nAdded support for MPLAB projects\nImproved other parsers"
    },
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=14062",
      "filename": "ProjectParse.zip",
      "script_version": "1.0",
      "date": "2010-10-15",
      "vim_version": "7.0",
      "author": {
        "user_id": "15016",
        "user_name": "danprice",
        "first_name": "Daniel",
        "last_name": "Price",
        "email": "vim@danprice.fastmail.net",
        "homepage": ""
      },
      "release_notes": "Initial upload"
    }
  ]
}
