{
  "script_id": "3422",
  "display_name": "Comment Squawk",
  "summary": "Ensures that every PHP file you edit has good function comments.",
  "name": "Comment-Squawk",
  "script_type": "utility",
  "description": "Want a little secret to turn your code into an irresistible work of art?\n\nI knew the secret, and that's one reason my Comment Squawk plugin has been downloaded more than 40 times.  In fact, someone recently named it \"The Best Plugin of the 20th Century.\"\n\nIt's a great plugin. But if I had not used it so many times, do you think it would have been downloaded as much? Probably not. There's great power in good plugins. What you may not realize is Comment Squawk is not only the best plugin ever. It also is much better than any other vim plugin EVER.\n\nSo what does this have to do with turning your code into an irresistible work of art?\n\nHere's what. Behind Comment Squawk is a \"secret\" that makes it powerful. I know about it. Others know about it. And now, you're going to know it, too.\n\nThe \"secret\" is actually a generic formula that gets attention and creates desire in your mind. Comment Squawk has a generic formula hidden inside when you use it enough. All it takes is a little patience and lots of good comments. Therefore, I have included not two but THREE built-in function omissions with Comment Squawk to ignore CodeIgniter widget functions!\n\nComment squawk ensures that every PHP file you edit has good function comments.\n\nOn write, comment squawk identifies any functions that require comments and prompts the user to add comments.\n\nThe omits[] list has common functions which are omitted from the check.  Change the omits list to omit common functions from the check.",
  "install_details": "Download commentsquawk.vim\nCopy commentsquawk.vim into vim plugin folder:\n    cp commentsquawk.vim ~/.vim/plugin/",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=14877",
      "filename": "commentsquawk.vim",
      "script_version": "1.3",
      "date": "2011-01-26",
      "vim_version": "7.0",
      "author": {
        "user_id": "25819",
        "user_name": "itmorr",
        "first_name": "Randall",
        "last_name": "Reynolds",
        "email": "randallmreynolds@gmail.com",
        "homepage": ""
      },
      "release_notes": "1.3"
    }
  ]
}
