{
  "script_id": "3574",
  "display_name": "gitv",
  "summary": "gitk for Vim.",
  "name": "gitv",
  "script_type": "utility",
  "description": "gitv is a 'gitk clone' plugin for the text editor Vim. The goal is to give you a similar set of functionality as a repository viewer.  Using this plugin you can view a repository's history including branching and merging, you can see which commits refs point to.  You can quickly and easily view what changed to which files and when. You can perform arbitrary diffs (using Vim's excellent built in diff functionality) and you can easily check out whole commits and branches or just individual files if need be.\n\nThrow in the fact that it is running in Vim and you get for free: the ability to move over repository history quickly and precisely using Vim's built in movement operators. You get excellent code syntax highlighting due to Vim's built in ability. You can open up all sorts of repository views in multiple windows and position them exactly as you like. You can take advantage of Vim's registers to copy multiple fragments of code from previous commits. The list goes on.\n\nThis plugin is an extension of the fugitive plugin.\n\nScreenshots can be found here: http://www.gregsexton.org/portfolio/gitv/.\n\nThe GitHub repository is here: https://github.com/gregsexton/gitv.\n\nI hope you like it!",
  "install_details": "Install in ~/.vim, or in ~\\vimfiles if you're on Windows. This plugin should be fully pathogen compatible if you want to install it this way.\n\ngitv was developed against Vim 7.3 but earlier versions of Vim should work.  Vim 7.2+ is recommended as it ships with syntax highlighting for many Git file types. **You will also need the fugitive plugin installed and working for gitv to work.**",
  "versions": [
    {
      "url": "http://www.vim.org/scripts/download_script.php?src_id=15572",
      "filename": "gitv-1.0.zip",
      "script_version": "1.0",
      "date": "2011-05-02",
      "vim_version": "7.0",
      "author": {
        "user_id": "23036",
        "user_name": "gregsexton",
        "first_name": "Greg",
        "last_name": "Sexton",
        "email": "gregsexton@gmail.com",
        "homepage": "http://www.gregsexton.org"
      },
      "release_notes": "Initial upload"
    }
  ]
}
